author: Florian Roth, Markus Neis
category: process_creation
date: 2018/09/03
description: Detects suspicious powershell process starts with base64 encoded commands
  (e.g. Emotet)
detection:
  condition: selection and not falsepositive1
  falsepositive1:
    winlog.event_data.CommandLine,: '* -ExecutionPolicy remotesigned *'
  selection:
    winlog.event_data.CommandLine,:
    - '* -e JAB*'
    - '* -e  JAB*'
    - '* -e   JAB*'
    - '* -e    JAB*'
    - '* -e     JAB*'
    - '* -e      JAB*'
    - '* -en JAB*'
    - '* -enc JAB*'
    - '* -enc* JAB*'
    - '* -w hidden -e* JAB*'
    - '* BA^J e-'
    - '* -e SUVYI*'
    - '* -e aWV4I*'
    - '* -e SQBFAFgA*'
    - '* -e aQBlAHgA*'
    - '* -enc SUVYI*'
    - '* -enc aWV4I*'
    - '* -enc SQBFAFgA*'
    - '* -enc aQBlAHgA*'
    - '* -e* IAA*'
    - '* -e* IAB*'
    - '* -e* UwB*'
    - '* -e* cwB*'
    - '*.exe -ENCOD *'
id: ca2092a1-c273-4878-9b4b-0d60115bf5ea
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/10/20
product: windows
references:
- https://app.any.run/tasks/6217d77d-3189-4db2-a957-8ab239f3e01e
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
title: Suspicious Encoded PowerShell Command Line
