action: global
author: Markus Neis
category: process_creation
date: 2017/11/07
description: Detects automated lateral movement by Turla group
detection:
  condition: netCommand1 | near netCommand2 and netCommand3
  netCommand1:
    winlog.event_data.CommandLine,: net view /DOMAIN
  netCommand2:
    winlog.event_data.CommandLine,: net session
  netCommand3:
    winlog.event_data.CommandLine,: net share
  timeframe: 1m
falsepositives:
- Unknown
id: c1f88cf2-758f-4ed5-9d7f-77e0826f5762
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/08/27
product: windows
references:
- https://securelist.com/the-epic-turla-operation/65545/
status: experimental
tags:
- attack.g0010
- attack.execution
- attack.t1059
- attack.lateral_movement
- attack.t1077
- attack.t1021.002
- attack.discovery
- attack.t1083
- attack.t1135
title: Turla Group Lateral Movement
