action: global
author: Aleksey Potapov, oscd.community
date: 2019/10/22
description: Detects SILENTTRINITY stager use
detection:
  condition: selection
  selection:
    EventID: 7
falsepositives:
- unknown
id: 4faaf4fa-5575-4db2-a980-d1b3d6d7322d
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/09/06
product: windows
references:
- https://github.com/byt3bl33d3r/SILENTTRINITY
service: sysmon
status: experimental
tags:
- attack.command_and_control
title: SILENTTRINITY Stager Execution
