author: Florian Roth
category: process_creation
date: 2019/12/30
description: Detects a suspicious copy command from a remote C$ or ADMIN$ share
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine,|contains:
    - copy *\c$
    - copy *\ADMIN$
falsepositives:
- Administrative scripts
fields:
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
id: 855bc8b5-2ae8-402e-a9ed-b889e6df1900
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/05
product: windows
references:
- https://twitter.com/SBousseaden/status/1211636381086339073
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.002
- attack.command_and_control
- attack.t1105
- attack.s0106
- attack.t1077
title: Copy from Admin Share
