author: wagga
category: process_creation
date: 2020/01/12
description: Detects command line parameters used by Koadic hack tool
detection:
  condition: selection1
  selection1:
    winlog.event_data.CommandLine,:
    - '*cmd.exe* /q /c chcp *'
falsepositives:
- Pentest
fields:
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
id: 5cddf373-ef00-4112-ad72-960ac29bac34
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://unit42.paloaltonetworks.com/unit42-sofacy-groups-parallel-attacks/
- https://github.com/zerosum0x0/koadic/blob/master/data/stager/js/stdlib.js#L955
- https://blog.f-secure.com/hunting-for-koadic-a-com-based-rootkit/
status: experimental
tags:
- attack.execution
- attack.t1059.003
- attack.t1059
- attack.t1059.005
- attack.t1059.007
- attack.t1064
title: Koadic Execution
