action: global
author: Aleksey Potapov, oscd.community
category: process_creation
date: 2019/10/22
description: Detects SILENTTRINITY stager use
detection:
  condition: selection
  selection:
    winlog.event_data.Description,|contains: st2stager
falsepositives:
- unknown
id: 445c5799-ed74-4e7d-a135-59a90fb4246b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/06
product: windows
references:
- https://github.com/byt3bl33d3r/SILENTTRINITY
status: experimental
tags:
- attack.command_and_control
title: SILENTTRINITY Stager Execution
