author: Nik Seetharaman
category: process_creation
date: 2019/01/16
description: Detects invocation of Microsoft Workflow Compiler, which may permit the
  execution of arbitrary unsigned code.
detection:
  condition: selection
  selection:
    winlog.event_data.Image,: '*\Microsoft.Workflow.Compiler.exe'
falsepositives:
- Legitimate MWC use (unlikely in modern enterprise environments)
fields:
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
id: 419dbf2b-8a9b-4bea-bf99-7544b050ec8d
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://posts.specterops.io/arbitrary-unsigned-code-execution-vector-in-microsoft-workflow-compiler-exe-3d9294bc5efb
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1127
title: Microsoft Workflow Compiler
