author: Cian Heasley
category: process_creation
date: 2020/08/13
description: In Kaspersky's 2020 Incident Response Analyst Report they listed legitimate
  tool "Mouse Lock" as being used for both credential access and collection in security
  incidents.
detection:
  condition: selection
  selection:
  - Product|contains: Mouse Lock
  - Company|contains: Misc314
  - CommandLine|contains: Mouse Lock_
falsepositives:
- Legitimate uses of Mouse Lock software
fields:
- winlog.event_data.Product,
- winlog.event_data.Company,
- winlog.event_data.CommandLine,
id: c9192ad9-75e5-43eb-8647-82a0a5b493e3
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
reference:
- https://github.com/klsecservices/Publications/blob/master/Incident-Response-Analyst-Report-2020.pdf
- https://sourceforge.net/projects/mouselock/
status: experimental
tags:
- attack.credential_access
- attack.collection
- attack.t1056.002
title: Mouse Lock Credential Gathering
