author: Cian Heasley
category: windows
date: 2020/08/13
description: Windows Defender logs when the history of detected infections is deleted.
  Log file will contain the message "Windows Defender Antivirus has removed history
  of malware and other potentially unwanted software".
detection:
  condition: selection
  selection:
    EventID: 1013
    EventType: 4
falsepositives:
- Deletion of Defender malware detections history for legitimate reasons
fields:
- EventID
- EventType
id: 2afe6582-e149-11ea-87d0-0242ac130003
level: high
logsource:
  category: windows
  product: windef
product: windef
reference:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.001
title: Windows Defender Malware Detection History Deletion
