author: Omer Yampel
category: registry_event
date: 2017/03/17
description: Detects changes to HKCU:\Software\Classes\exefile\shell\runas\command\isolatedCommand
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject,: HKU\\*_Classes\exefile\shell\runas\command\isolatedCommand
falsepositives:
- unknown
id: 5b872a46-3b90-45c1-8419-f675db8053aa
level: high
logsource:
  category: registry_event
  product: windows
modified: 2020/09/06
product: windows
references:
- https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1088
- attack.t1548.002
- car.2019-04-001
title: UAC Bypass via Sdclt
