author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/10
description: Detects remote PowerShell sessions
detection:
  condition: selection
  selection:
    HostApplication|contains: wsmprovhost.exe
    HostName: ServerRemoteHost
    winlog.event_id:
    - 4103
    - 400
falsepositives:
- Legitimate use remote PowerShell sessions
id: 96b9f619-aa91-478f-bacb-c3e50f8df575
level: high
logsource:
  product: windows
  service: powershell
modified: 2020/08/24
product: windows
references:
- https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/powershell_remote_session.md
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
- attack.lateral_movement
- attack.t1021.006
- attack.t1028
title: Remote PowerShell Session
