author: Alec Costello
date: 2019/05/16
definition: It is recommanded to use the new "Script Block Logging" of PowerShell
  v5 https://adsecurity.org/?p=2277
description: Detects Commandlet names and arguments from the Nishang exploitation
  framework
detection:
  condition: keywords
  keywords:
  - exfill
  - winlog.event_data.Add-ConstrainedDelegationBackdoor
  - winlog.event_data.Set-DCShadowPermissions
  - winlog.event_data.DNS_TXT_Pwnage
  - winlog.event_data.Execute-OnTime
  - winlog.event_data.HTTP-Backdoor
  - winlog.event_data.Set-RemotePSRemoting
  - winlog.event_data.Set-RemoteWMI
  - winlog.event_data.Invoke-AmsiBypass
  - winlog.event_data.Out-CHM
  - winlog.event_data.Out-HTA
  - winlog.event_data.Out-SCF
  - winlog.event_data.Out-SCT
  - winlog.event_data.Out-Shortcut
  - winlog.event_data.Out-WebQuery
  - winlog.event_data.Out-Word
  - winlog.event_data.Enable-Duplication
  - winlog.event_data.Remove-Update
  - winlog.event_data.Download-Execute-PS
  - winlog.event_data.Download_Execute
  - winlog.event_data.Execute-Command-MSSQL
  - winlog.event_data.Execute-DNSTXT-Code
  - winlog.event_data.Out-RundllCommand
  - winlog.event_data.Copy-VSS
  - winlog.event_data.FireBuster
  - winlog.event_data.FireListener
  - winlog.event_data.Get-Information
  - winlog.event_data.Get-PassHints
  - winlog.event_data.Get-WLAN-Keys
  - winlog.event_data.Get-Web-Credentials
  - winlog.event_data.Invoke-CredentialsPhish
  - winlog.event_data.Invoke-MimikatzWDigestDowngrade
  - winlog.event_data.Invoke-SSIDExfil
  - winlog.event_data.Invoke-SessionGopher
  - winlog.event_data.Keylogger
  - winlog.event_data.Invoke-Interceptor
  - winlog.event_data.Create-MultipleSessions
  - winlog.event_data.Invoke-NetworkRelay
  - winlog.event_data.Run-EXEonRemote
  - winlog.event_data.Invoke-Prasadhak
  - winlog.event_data.Invoke-BruteForce
  - winlog.event_data.Password-List
  - winlog.event_data.Invoke-JSRatRegsvr
  - winlog.event_data.Invoke-JSRatRundll
  - winlog.event_data.Invoke-PoshRatHttps
  - winlog.event_data.Invoke-PowerShellIcmp
  - winlog.event_data.Invoke-PowerShellUdp
  - winlog.event_data.Invoke-PSGcat
  - winlog.event_data.Invoke-PsGcatAgent
  - winlog.event_data.Remove-PoshRat
  - winlog.event_data.Add-Persistance
  - winlog.event_data.ExetoText
  - winlog.event_data.Invoke-Decode
  - winlog.event_data.Invoke-Encode
  - winlog.event_data.Parse_Keys
  - winlog.event_data.Remove-Persistence
  - winlog.event_data.StringtoBase64
  - winlog.event_data.TexttoExe
  - winlog.event_data.Powerpreter
  - winlog.event_data.Nishang
  - winlog.event_data.DataToEncode
  - winlog.event_data.LoggedKeys
  - winlog.event_data.OUT-DNSTXT
  - winlog.event_data.Jitter
  - winlog.event_data.ExfilOption
  - winlog.event_data.Tamper
  - winlog.event_data.DumpCerts
  - winlog.event_data.DumpCreds
  - winlog.event_data.Shellcode32
  - winlog.event_data.Shellcode64
  - winlog.event_data.NotAllNameSpaces
  - winlog.event_data.FakeDC
  - winlog.event_data.Exploit
falsepositives:
- Penetration testing
id: f772cee9-b7c2-4cb2-8f07-49870adc02e0
level: high
logsource:
  definition: It is recommanded to use the new "Script Block Logging" of PowerShell
    v5 https://adsecurity.org/?p=2277
  product: windows
  service: powershell
product: windows
references:
- https://github.com/samratashok/nishang
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
title: Malicious Nishang PowerShell Commandlets
