author: David Ledbetter (shellcode), Florian Roth (rule)
date: 2018/11/17
definition: Script block logging must be enabled
description: Detects Base64 encoded Shellcode
detection:
  condition: selection and keyword1 and keyword2
  keyword1:
  - '*AAAAYInlM*'
  keyword2:
  - '*OiCAAAAYInlM*'
  - '*OiJAAAAYInlM*'
  selection:
    EventID: 4104
falsepositives:
- Unknown
id: 16b37b70-6fcf-4814-a092-c36bd3aafcbd
level: critical
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2020/08/24
product: windows
references:
- https://twitter.com/cyb3rops/status/1063072865992523776
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
- attack.execution
- attack.t1059.001
- attack.t1086
title: PowerShell ShellCode
