author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/11
description: Detects alternate PowerShell hosts potentially bypassing detections looking
  for powershell.exe
detection:
  condition: selection and not filter
  filter:
  - ContextInfo: powershell.exe
  - Message: powershell.exe
  selection:
    ContextInfo: '*'
    winlog.event_id:
    - 4103
    - 400
falsepositives:
- Programs using PowerShell directly without invocation of a dedicated interpreter
- MSP Detection Searcher
- Citrix ConfigSync.ps1
id: 64e8e417-c19a-475a-8d19-98ea705394cc
level: medium
logsource:
  product: windows
  service: powershell
product: windows
references:
- https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/alternate_signed_powershell_hosts.md
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
title: Alternate PowerShell Hosts
