author: Florian Roth (rule)
date: 2017/03/05
description: Detects suspicious PowerShell invocation command parameters
detection:
  condition: keywords
  keywords:
    Message:
    - '* -nop -w hidden -c * [Convert]::FromBase64String*'
    - '* -w hidden -noni -nop -c "iex(New-Object*'
    - '* -w hidden -ep bypass -Enc*'
    - '*powershell.exe reg add HKCU\software\microsoft\windows\currentversion\run*'
    - '*bypass -noprofile -windowstyle hidden (new-object system.net.webclient).download*'
    - '*iex(New-Object Net.WebClient).Download*'
falsepositives:
- Penetration tests
id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
level: high
logsource:
  product: windows
  service: powershell
product: windows
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Invocations - Specific
