author: Florian Roth, Perez Diego (@darkquassar)
date: 2019/02/11
definition: It is recommended to use the new "Script Block Logging" of PowerShell
  v5 https://adsecurity.org/?p=2277. Monitor for EventID 4104
description: Detects keywords that could indicate the use of some PowerShell exploitation
  framework
detection:
  condition: keywords
  keywords:
    Message:
    - System.Reflection.Assembly.Load
    - '[System.Reflection.Assembly]::Load'
    - '[Reflection.Assembly]::Load'
    - System.Reflection.AssemblyName
    - Reflection.Emit.AssemblyBuilderAccess
    - Runtime.InteropServices.DllImportAttribute
    - SuspendThread
falsepositives:
- Penetration tests
id: 1f49f2ab-26bc-48b3-96cc-dcffbc93eadf
level: high
logsource:
  definition: It is recommended to use the new "Script Block Logging" of PowerShell
    v5 https://adsecurity.org/?p=2277. Monitor for EventID 4104
  product: windows
  service: powershell
product: windows
references:
- https://posts.specterops.io/entering-a-covenant-net-command-and-control-e11038bcf462
- https://github.com/PowerShellMafia/PowerSploit/blob/master/CodeExecution/Invoke-ReflectivePEInjection.ps1
- https://github.com/hlldz/Invoke-Phant0m/blob/master/Invoke-Phant0m.ps1
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
title: Suspicious PowerShell Keywords
