author: Ilyas Ochkov, oscd.community
date: 2019/10/25
description: Detects keywords that could indicate clearing PowerShell history
detection:
  condition: keywords
  keywords:
  - del (Get-PSReadlineOption).HistorySavePath
  - "Set-PSReadlineOption \u2013HistorySaveStyle SaveNothing"
  - Remove-Item (Get-PSReadlineOption).HistorySavePath
  - rm (Get-PSReadlineOption).HistorySavePath
falsepositives:
- some PS-scripts
id: dfba4ce1-e0ea-495f-986e-97140f31af2d
level: medium
logsource:
  product: windows
  service: powershell
product: windows
references:
- https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.003
title: Clear PowerShell History
