author: '@ROxPinTeddy'
date: 2020/04/11
description: Detects creation of a local user via PowerShell
detection:
  condition: selection
  selection:
    Message|contains:
    - New-LocalUser
    winlog.event_id: 4104
falsepositives:
- Legitimate user creation
id: 243de76f-4725-4f2e-8225-a8a69b15ad61
level: medium
logsource:
  product: windows
  service: powershell
modified: 2020/08/24
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1136/T1136.md
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
- attack.persistence
- attack.t1136.001
- attack.t1136
title: PowerShell Create Local User
