author: Florian Roth
date: 2017/03/05
description: Detects suspicious PowerShell download command
detection:
  condition: downloadfile or downloadstring
  downloadfile:
    Message|contains|all:
    - System.Net.WebClient
    - .DownloadFile(
  downloadstring:
    Message|contains|all:
    - System.Net.WebClient
    - .DownloadString(
falsepositives:
- PowerShell scripts that download content from the Internet
id: 65531a81-a694-4e31-ae04-f8ba5bc33759
level: medium
logsource:
  product: windows
  service: powershell
product: windows
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
title: Suspicious PowerShell Download
