action: global
author: James Pemberton / @4A616D6573
date: 2019/10/24
description: Detects the use of various web request methods (including aliases) via
  Windows PowerShell
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - 'iwr '
    - 'wget '
    - 'curl '
    - winlog.event_data.Invoke-WebRequest
    - winlog.event_data.Net.WebClient
    - winlog.event_data.Start-BitsTransfer
    winlog.event_id: 4104
falsepositives:
- Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer.
id: 8d1f396f-d411-467b-9b30-2ff548a9c27e
level: medium
logsource:
  product: windows
  service: powershell
modified: 2020/08/24
product: windows
references:
- https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/
- https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1086
title: Windows PowerShell Web Request
