action: global
author: Daniil Yugoslavskiy, oscd.community
category: firewall
date: 2019/10/24
description: High DNS queries bytes amount from host per short period of time
detection:
  condition: selection | sum(message_size) by src_ip > 300000
  selection:
    dest_port: 53
  timeframe: 1m
falsepositives:
- Legitimate high DNS bytes out rate to domain name which should be added to whitelist
id: 5fac873d-b118-422f-bcee-64180701b381
level: medium
logsource:
  category: firewall
  product: suricata
modified: 2020/08/27
product: suricata
status: experimental
tags:
- attack.exfiltration
- attack.t1048
- attack.t1048.003
title: High DNS Bytes Out
