author: Florian Roth
category: network_connection
date: 2017/03/19
definition: Use the following config to generate the necessary Event ID 3 Network
  Connection events
description: Detects programs with network connections running in suspicious files
  system locations
detection:
  condition: selection
  selection:
    winlog.event_data.Image:
    - '*\$Recycle.bin'
    - '*\Users\All Users\\*'
    - '*\Users\Default\\*'
    - '*\Users\Public\\*'
    - '*\Users\Contacts\\*'
    - '*\Users\Searches\\*'
    - C:\Perflogs\\*
    - '*\config\systemprofile\\*'
    - '*\Windows\Fonts\\*'
    - '*\Windows\IME\\*'
    - '*\Windows\addins\\*'
falsepositives:
- unknown
id: 7b434893-c57d-4f41-908d-6a17bf1ae98f
level: high
logsource:
  category: network_connection
  definition: Use the following config to generate the necessary Event ID 3 Network
    Connection events
  product: windows
product: windows
references:
- https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo
status: experimental
title: Suspicious Program Location with Network Connections
