action: global
author: Dmitriy Lifanov, oscd.community
category: dns_query
date: 2019/10/25
description: Detects network connections and DNS queries initiated by Regsvr32.exe
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \regsvr32.exe
falsepositives:
- unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
- winlog.event_data.DestinationIp
- winlog.event_data.DestinationPort
id: 0bcdb31d-b7c1-47d0-b3c9-706eed743681
level: high
logsource:
  category: dns_query
  product: windows
modified: 2020/08/24
product: windows
references:
- https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/
- https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1117/T1117.md
status: experimental
tags:
- attack.execution
- attack.t1559.001
- attack.t1175
- attack.defense_evasion
- attack.t1218.010
- attack.t1117
title: Regsvr32 Network Activity
