author: "\xD6mer G\xFCnal"
date: 2020/06/17
description: Detects disabling security tools
detection:
  condition: keywords
  keywords:
  - Command|contains:
    - service iptables stop
    - chkconfig off iptables
    - service ip6tables stop
    - chkconfig off ip6tables
  - CarbonBlack|contains:
    - service cbdaemon stop
    - chkconfig off cbdaemon
    - systemctl stop cbdaemon
    - systemctl disable cbdaemon
  - SELinux:
    - setenforce 0
  - Crowdstrike|contains:
    - systemctl stop falcon-sensor.service
    - systemctl disable falcon-sensor.service
falsepositives:
- Legitimate administration activities
id: e3a8a052-111f-4606-9aee-f28ebeb76776
level: medium
logsource:
  product: linux
product: linux
references:
- https://attack.mitre.org/techniques/T1089/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1089/T1089.md
status: experimental
tags:
- attack.defense_evasion
title: Disabling Security Tools
