action: global
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
  using tunnelling techniques
detection:
  condition: selection and selection_1
  selection:
    EventID: 7045
  selection_1:
    winlog.event_data.ImagePath,|contains: tap0901
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: 745a76bd-8c9e-421d-83c2-ce52457b3769
level: medium
logsource:
  product: windows
  service: system
product: windows
service: system
status: experimental
tags:
- attack.exfiltration
- attack.t1048
title: Tap Driver Installation
