author: Keith Wright
date: 2019/11/20
description: Detects external diskdrives or plugged in USB devices
detection:
  condition: selection or selection2
  selection:
    DeviceClassName: DiskDrive
    EventID:
    - 6416
  selection2:
    DeviceDescription: USB Mass Storage Device
falsepositives:
- Legitimate administrative activity
id: f69a87ea-955e-4fb4-adb2-bb9fd6685632
level: low
logsource:
  product: windows
  service: security
product: windows
service: security
status: experimental
tags:
- attack.t1091
- attack.t1200
- attack.lateral_movement
- attack.initial_access
title: External Disk Drive or USB Storage Device
