author: Benjamin Delpy, Florian Roth, Scott Dermott
date: 2018/06/03
description: Detects Mimikatz DC sync security events
detection:
  condition: selection and not filter1 and not filter2
  filter1:
    winlog.event_data.SubjectDomainName,: Window Manager
  filter2:
    winlog.event_data.SubjectUserName,:
    - NT AUTHORITY*
    - '*$'
    - MSOL_*
  selection:
    EventID: 4662
    winlog.event_data.Properties,:
    - '*Replicating Directory Changes All*'
    - '*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*'
falsepositives:
- Valid DC Sync that is not covered by the filters; please report
id: 611eab06-a145-4dfa-a295-3ccc5c20f59a
level: high
logsource:
  product: windows
  service: security
modified: 2020/09/11
product: windows
references:
- https://twitter.com/gentilkiwi/status/1003236624925413376
- https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2
service: security
status: experimental
tags:
- attack.credential_access
- attack.s0002
- attack.t1003
- attack.t1003.006
title: Mimikatz DC Sync
