author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/15
description: Detects non-system users performing privileged operation os the SCM database
detection:
  condition: selection
  selection:
    EventID: 4674
    winlog.event_data.ObjectName,: servicesactive
    winlog.event_data.ObjectType,: SC_MANAGER OBJECT
    winlog.event_data.PrivilegeList,: SeTakeOwnershipPrivilege
    winlog.event_data.SubjectLogonId,: '0x3e4'
falsepositives:
- Unknown
id: dae8171c-5ec6-4396-b210-8466585b53e9
level: critical
logsource:
  product: windows
  service: security
product: windows
references:
- https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/07_discovery/T1000_local_admin_check/local_admin_remote_check_openscmanager.md
service: security
status: experimental
title: SCM Database Privileged Operation
