author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/06/20
description: Detects potential mimikatz-like tools accessing LSASS from non system
  account
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.SubjectUserName,|endswith: $
  selection:
    EventID:
    - 4663
    - 4656
    winlog.event_data.ObjectName,|endswith: \lsass.exe
    winlog.event_data.ObjectType,: Process
falsepositives:
- Unknown
fields:
- winlog.ComputerName,
- winlog.event_data.ObjectName,
- winlog.event_data.SubjectUserName,
- winlog.event_data.ProcessName,
id: 962fe167-e48d-4fd6-9974-11e5b9a5d6d1
level: critical
logsource:
  product: windows
  service: security
modified: 2019/11/10
product: windows
references:
- https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/06_credential_access/T1003_credential_dumping/lsass_access_non_system_account.md
service: security
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
title: LSASS Access from Non System Account
