author: Roberto Rodriguez @Cyb3rWard0g
category: image_load
date: 2019/08/10
description: Detects non wmiprvse loading WMI modules
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image,|endswith:
    - \WmiPrvSe.exe
    - \WmiAPsrv.exe
    - \svchost.exe
    - \DeviceCensus.exe
    - \CompatTelRunner.exe
    - \sdiagnhost.exe
    - \SIHClient.exe
    - \ngentask.exe
    - \windows\system32\taskhostw.exe
    - \windows\system32\MoUsoCoreWorker.exe
  selection:
    winlog.event_data.ImageLoaded,|endswith:
    - \wmiclnt.dll
    - \WmiApRpl.dll
    - \wmiprov.dll
    - \wmiutils.dll
    - \wbemcomn.dll
    - \wbemprox.dll
    - \WMINet_Utils.dll
    - \wbemsvc.dll
    - \fastprox.dll
falsepositives:
- Unknown
fields:
- winlog.ComputerName,
- winlog.event_data.User,
- winlog.event_data.Image,
- winlog.event_data.ImageLoaded,
id: 671bb7e3-a020-4824-a00e-2ee5b55f385e
level: high
logsource:
  category: image_load
  product: windows
modified: 2019/11/10
product: windows
references:
- https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1047_windows_management_instrumentation/wmi_wmi_module_load.md
status: experimental
tags:
- attack.execution
- attack.t1047
title: WMI Modules Loaded
