author: Florian Roth
category: process_creation
date: 2019/01/16
description: Detects a Powershell process that contains download commands in its command
  line string
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine,:
    - '*new-object system.net.webclient).downloadstring(*'
    - '*new-object system.net.webclient).downloadfile(*'
    - '*new-object net.webclient).downloadstring(*'
    - '*new-object net.webclient).downloadfile(*'
    winlog.event_data.Image,: '*\powershell.exe'
falsepositives:
- unknown
fields:
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
id: 3b6ab547-8ec2-4991-b9d2-2b06702a48d7
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
status: experimental
tags:
- attack.t1086
- attack.execution
- attack.t1059.001
title: PowerShell Download from URL
