author: Nik Seetharaman
category: process_creation
date: 2019/01/16
description: Detects UAC Bypass Attempt Using Microsoft Connection Manager Profile
  Installer Autoelevate-capable COM Objects
detection:
  condition: selection1 and selection2
  selection1:
    winlog.event_data.ParentCommandLine,|contains: '\DllHost.exe '
  selection2:
    winlog.event_data.ParentCommandLine,|endswith:
    - '{3E5FC7F9-9A51-4367-9063-A120244FBEC7}'
    - '{3E000D72-A845-4CD9-BD83-80C07C3B881F}'
falsepositives:
- Legitimate CMSTP use (unlikely in modern enterprise environments)
fields:
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
- winlog.event_data.Hashes,
id: 4b60e6f2-bf39-47b4-b4ea-398e33cfe253
level: high
logsource:
  category: process_creation
  product: windows
modified: 2019/07/31
product: windows
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
- https://twitter.com/hFireF0X/status/897640081053364225
status: stable
tags:
- attack.execution
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- attack.t1088
- attack.t1218.003
- attack.t1191
- attack.g0069
- car.2019-04-001
title: CMSTP UAC Bypass via COM Object Access
