author: jmallette
category: process_creation
date: 2019/01/16
description: Detects usage of cmdkey to look for cached credentials
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine,: '* /list *'
    winlog.event_data.Image,: '*\cmdkey.exe'
falsepositives:
- Legitimate administrative tasks.
fields:
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
- winlog.event_data.User,
id: 07f8bdc2-c9b3-472a-9817-5a670b872f53
level: low
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
- https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
status: experimental
tags:
- attack.credential_access
- attack.t1003.005
- attack.t1003
title: Cmdkey Cached Credentials Recon
