action: global
author: Florian Roth
category: process_creation
date: 2019/12/20
description: Detects activity mentioned in Operation Wocao report
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine,|contains:
    - checkadmin.exe 127.0.0.1 -all
    - netsh advfirewall firewall add rule name=powershell dir=in
    - cmd /c powershell.exe -ep bypass -file c:\s.ps1
    - /tn win32times /f
    - create win32times binPath=
    - \c$\windows\system32\devmgr.dll
    - ' -exec bypass -enc JgAg'
    - type *keepass\KeePass.config.xml
    - iie.exe iie.txt
    - reg query HKEY_CURRENT_USER\Software\\*\PuTTY\Sessions\
falsepositives:
- Administrators that use checkadmin.exe tool to enumerate local administrators
id: 726264de-5eaf-4641-98a0-ab0d76f6b1c6
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/26
product: windows
references:
- https://www.fox-it.com/en/news/whitepapers/operation-wocao-shining-a-light-on-one-of-chinas-hidden-hacking-groups/
- https://twitter.com/SBousseaden/status/1207671369963646976
status: experimental
tags:
- attack.discovery
- attack.t1012
- attack.defense_evasion
- attack.t1036.004
- attack.t1036
- attack.t1027
- attack.execution
- attack.t1053.005
- attack.t1053
- attack.t1059.001
- attack.t1086
title: Operation Wocao Activity
