author: Florian Roth
category: process_creation
date: 2019/01/15
description: Detects programs running in suspicious files system locations
detection:
  condition: selection
  selection:
    winlog.event_data.Image,:
    - '*\$Recycle.bin'
    - '*\Users\Public\\*'
    - C:\Perflogs\\*
    - '*\Windows\Fonts\\*'
    - '*\Windows\IME\\*'
    - '*\Windows\addins\\*'
    - '*\Windows\debug\\*'
falsepositives:
- unknown
id: f50bfd8b-e2a3-4c15-9373-7900b5a4c6d5
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
title: Suspicious Program Location Process Starts
