author: Markus Neis, keepwatch
category: process_creation
date: 2018/11/14
description: Detects Service Principal Name Enumeration used for Kerberoasting
detection:
  cmd:
    winlog.event_data.CommandLine,: '*-q*'
  condition: (selection_image or selection_desc) and cmd
  selection_desc:
    winlog.event_data.Description,: '*Query or reset the computer* SPN attribute*'
  selection_image:
    winlog.event_data.Image,: '*\setspn.exe'
falsepositives:
- Administrator Activity
id: 1eeed653-dbc8-4187-ad0c-eeebb20e6599
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://p16.praetorian.com/blog/how-to-use-kerberoasting-t1208-for-privilege-escalation
status: experimental
tags:
- attack.credential_access
- attack.t1558.003
- attack.t1208
title: Possible SPN Enumeration
