author: Thomas Patzke
category: process_creation
date: 2019/01/16
description: Detects execution of ntdsutil.exe, which can be used for various attacks
  against the NTDS database (NTDS.DIT)
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine,: '*\ntdsutil*'
falsepositives:
- NTDS maintenance
id: 2afafd61-6aae-4df4-baed-139fa1f4c345
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/ntdsutil.htm
status: experimental
tags:
- attack.credential_access
- attack.t1003.003
- attack.t1003
title: Invocation of Active Directory Diagnostic Tool (ntdsutil.exe)
