author: Florian Roth
category: process_creation
date: 2017/06/12
description: Detects the execution of an executable that is typically used by PlugX
  for DLL side loading started from an uncommon location
detection:
  condition: ( selection_cammute and not filter_cammute ) or ( selection_chrome_frame
    and not filter_chrome_frame ) or ( selection_devemu and not filter_devemu ) or
    ( selection_gadget and not filter_gadget ) or ( selection_hcc and not filter_hcc
    ) or ( selection_hkcmd and not filter_hkcmd ) or ( selection_mc and not filter_mc
    ) or ( selection_msmpeng and not filter_msmpeng ) or ( selection_msseces and not
    filter_msseces ) or ( selection_oinfo and not filter_oinfo ) or ( selection_oleview
    and not filter_oleview ) or ( selection_rc and not filter_rc )
  filter_cammute:
    winlog.event_data.Image,: '*\Lenovo\Communication Utility\\*'
  filter_chrome_frame:
    winlog.event_data.Image,: '*\Google\Chrome\application\\*'
  filter_devemu:
    winlog.event_data.Image,: '*\Microsoft Device Emulator\\*'
  filter_gadget:
    winlog.event_data.Image,: '*\Windows Media Player\\*'
  filter_hcc:
    winlog.event_data.Image,: '*\HTML Help Workshop\\*'
  filter_hkcmd:
    winlog.event_data.Image,:
    - '*\System32\\*'
    - '*\SysNative\\*'
    - '*\SysWowo64\\*'
  filter_mc:
    winlog.event_data.Image,:
    - '*\Microsoft Visual Studio*'
    - '*\Microsoft SDK*'
    - '*\Windows Kit*'
  filter_msmpeng:
    winlog.event_data.Image,:
    - '*\Microsoft Security Client\\*'
    - '*\Windows Defender\\*'
    - '*\AntiMalware\\*'
  filter_msseces:
    winlog.event_data.Image,:
    - '*\Microsoft Security Center\\*'
    - '*\Microsoft Security Client\\*'
    - '*\Microsoft Security Essentials\\*'
  filter_oinfo:
    winlog.event_data.Image,: '*\Common Files\Microsoft Shared\\*'
  filter_oleview:
    winlog.event_data.Image,:
    - '*\Microsoft Visual Studio*'
    - '*\Microsoft SDK*'
    - '*\Windows Kit*'
    - '*\Windows Resource Kit\\*'
  filter_rc:
    winlog.event_data.Image,:
    - '*\Microsoft Visual Studio*'
    - '*\Microsoft SDK*'
    - '*\Windows Kit*'
    - '*\Windows Resource Kit\\*'
    - '*\Microsoft.NET\\*'
  selection_cammute:
    winlog.event_data.Image,: '*\CamMute.exe'
  selection_chrome_frame:
    winlog.event_data.Image,: '*\chrome_frame_helper.exe'
  selection_devemu:
    winlog.event_data.Image,: '*\dvcemumanager.exe'
  selection_gadget:
    winlog.event_data.Image,: '*\Gadget.exe'
  selection_hcc:
    winlog.event_data.Image,: '*\hcc.exe'
  selection_hkcmd:
    winlog.event_data.Image,: '*\hkcmd.exe'
  selection_mc:
    winlog.event_data.Image,: '*\Mc.exe'
  selection_msmpeng:
    winlog.event_data.Image,: '*\MsMpEng.exe'
  selection_msseces:
    winlog.event_data.Image,: '*\msseces.exe'
  selection_oinfo:
    winlog.event_data.Image,: '*\OInfoP11.exe'
  selection_oleview:
    winlog.event_data.Image,: '*\OleView.exe'
  selection_rc:
    winlog.event_data.Image,: '*\rc.exe'
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
id: aeab5ec5-be14-471a-80e8-e344418305c2
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- http://www.hexacorn.com/blog/2016/03/10/beyond-good-ol-run-key-part-36/
- https://countuponsecurity.com/2017/06/07/threat-hunting-in-the-enterprise-with-appcompatprocessor/
status: experimental
tags:
- attack.s0013
- attack.defense_evasion
- attack.t1073
- attack.t1574.002
title: Executable Used by PlugX in Uncommon Location
