author: Florian Roth
category: process_creation
date: 2017/01/01
description: Detects certain command line parameters often used during reconnaissance
  activity via web shells
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine,:
    - '*whoami*'
    - '*net user *'
    - '*ping -n *'
    - '*systeminfo'
    - '*&cd&echo*'
    - '*cd /d*'
    winlog.event_data.ParentImage,:
    - '*\apache*'
    - '*\tomcat*'
    - '*\w3wp.exe'
    - '*\php-cgi.exe'
    - '*\nginx.exe'
    - '*\httpd.exe'
falsepositives:
- unknown
fields:
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
id: bed2a484-9348-4143-8a8a-b801c979301c
level: high
logsource:
  category: process_creation
  product: windows
modified: 2019/10/26
product: windows
reference:
- https://www.fireeye.com/blog/threat-research/2013/08/breaking-down-the-china-chopper-web-shell-part-ii.html
tags:
- attack.persistence
- attack.t1505.003
- attack.privilege_escalation
- attack.t1100
title: Webshell Detection With Command Line Keywords
