author: Florian Roth
category: process_creation
date: 2012/12/11
description: Detects suspicious IIS native-code module installations via command line
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine,:
    - '*\APPCMD.EXE install module /name:*'
falsepositives:
- Unknown as it may vary from organisation to arganisation how admins use to install
  IIS modules
id: 9465ddf4-f9e4-4ebd-8d98-702df3a93239
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://researchcenter.paloaltonetworks.com/2018/01/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
status: experimental
tags:
- attack.persistence
- attack.t1505.003
- attack.t1100
title: IIS Native-Code Module Command Line Installation
