action: global
author: Florian Roth
date: 2019/12/22
description: Detects the use of CreateMiniDump hack tool used to dump the LSASS process
  memory for credential extraction on the attacker's machine
detection:
  condition: 1 of them
  selection:
    EventID: 11
    winlog.event_data.TargetFilename,|contains: '*\lsass.dmp'
falsepositives:
- Unknown
id: 78de8f13-d79f-4087-8f2b-c93070d42467
level: high
logsource:
  product: windows
  service: sysmon
product: windows
references:
- https://ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsass-passwords-without-mimikatz-minidumpwritedump-av-signature-bypass
service: sysmon
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003
title: CreateMiniDump Hacktool
