author: '@ROxPinTeddy'
category: process_creation
date: 2020/05/12
description: Detects the use of rar.exe, on the command line, to create an archive
  with password protection or with a specific compression level. This is pretty indicative
  of malicious actions.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine,|contains|all:
    - ' -hp'
    - ' -m'
falsepositives:
- Legitimate use of Winrar command line version
- Other command line tools, that use these flags
id: faa48cae-6b25-4f00-a094-08947fef582f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/08/28
product: windows
references:
- https://labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/
status: experimental
tags:
- attack.collection
- attack.t1560.001
- attack.exfiltration
- attack.t1002
title: Rar with Password or Compression Level
