author: Bhabesh Raj
date: 2020/09/14
description: Detects triggering of AMSI by Windows Defender.
detection:
  condition: selection
  selection:
    DetectionSource: AMSI
    winlog.event_id: 1116
falsepositives:
- unlikely
id: ea9bf0fa-edec-4fb8-8b78-b119f2528186
level: high
logsource:
  product: windows
  service: windefend
product: windows
references:
- https://docs.microsoft.com/en-us/windows/win32/amsi/how-amsi-helps
service: windefend
status: stable
title: Windows Defender AMSI Trigger Detected
