action: global
author: Thomas Patzke
category: process_creation
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
  Sysmon)
detection:
  condition: 1 of them
  service_execution:
    winlog.event_data.ServiceName: PSEXESVC
    winlog.event_id: 7036
  service_installation:
    winlog.event_data.ServiceFileName: '*\PSEXESVC.exe'
    winlog.event_data.ServiceName: PSEXESVC
    winlog.event_id: 7045
  sysmon_processcreation:
    winlog.event_data.Image: '*\PSEXESVC.exe'
    winlog.event_data.User: NT AUTHORITY\SYSTEM
falsepositives:
- unknown
fields:
- winlog.event_id
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.ServiceName
- winlog.event_data.ServiceFileName
id: 90e4dad1-9466-4f8f-82f8-4a5a40528d47
level: low
logsource:
  category: process_creation
  product: windows
modified: 2020/08/23
product: windows
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
status: experimental
tags:
- attack.execution
- attack.t1035
- attack.t1569.002
- attack.s0029
title: PsExec Tool Execution
