action: global
author: Thomas Patzke
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
  Sysmon)
detection:
  condition: 1 of them
  service_execution:
    EventID: 7036
    winlog.event_data.ServiceName: PSEXESVC
  service_installation:
    EventID: 7045
    winlog.event_data.ServiceFileName: '*\PSEXESVC.exe'
    winlog.event_data.ServiceName: PSEXESVC
falsepositives:
- unknown
fields:
- winlog.event_data.EventID
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.ServiceName
- winlog.event_data.ServiceFileName
id: 92518b8a-1662-4385-968f-122a938c6b4e
level: low
logsource:
  product: windows
  service: system
modified: 2020/08/23
product: windows
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
service: system
status: experimental
tags:
- attack.execution
- attack.t1035
- attack.t1569.002
- attack.s0029
title: PsExec Tool Execution
