author: Florian Roth
date: 2017/08/22
description: Detects suspicious WMI event filter and command line event consumer based
  on event id 5861 and 5859 (Windows 10, 2012 and higher)
detection:
  condition: selection and 1 of keywords or selection2
  keywords:
    Message:
    - '*ActiveScriptEventConsumer*'
    - '*CommandLineEventConsumer*'
    - '*CommandLineTemplate*'
  selection:
    winlog.event_id: 5861
  selection2:
    winlog.event_id: 5859
falsepositives:
- Unknown (data set is too small; further testing needed)
id: 0b7889b4-5577-4521-a60a-3376ee7f9f7b
level: medium
logsource:
  product: windows
  service: wmi
modified: 2020/08/23
product: windows
references:
- https://twitter.com/mattifestation/status/899646620148539397
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
service: wmi
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.003
title: WMI Persistence
