author: Sami Ruohonen
date: 2018/07/24
definition: It is recommended to use the new "Script Block Logging" of PowerShell
  v5 https://adsecurity.org/?p=2277
description: Detects writing data into NTFS alternate data streams from powershell.
  Needs Script Block Logging.
detection:
  condition: keyword1 and keyword2
  keyword1:
  - set-content
  - add-content
  keyword2:
  - -stream
falsepositives:
- unknown
id: 8c521530-5169-495d-a199-0a3a881ad24e
level: high
logsource:
  definition: It is recommended to use the new "Script Block Logging" of PowerShell
    v5 https://adsecurity.org/?p=2277
  product: windows
  service: powershell
modified: 2020/08/24
product: windows
references:
- http://www.powertheshell.com/ntfsstreams/
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
- attack.t1096
- attack.execution
- attack.t1059.001
- attack.t1086
title: NTFS Alternate Data Stream
