action: global
author: Florian Roth
category: process_creation
date: 2017/05/08
description: Detects the installation of a plugin DLL via ServerLevelPluginDll parameter
  in Registry, which can be used to execute code in context of the DNS server (restart
  required)
detection:
  condition: 1 of them
  dnsadmin:
    winlog.event_data.CommandLine: dnscmd.exe /config /serverlevelplugindll *
falsepositives:
- unknown
fields:
- winlog.event_data.EventID
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.Image
- winlog.event_data.User
- winlog.event_data.TargetObject
id: 80ec0f10-6b6b-4f7f-9a71-a75967850979
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/06
product: windows
references:
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
status: experimental
tags:
- attack.defense_evasion
- attack.t1073
- attack.t1574.002
- attack.t1112
title: DNS ServerLevelPluginDll Install
