action: global
author: Markus Neis
category: process_creation
date: 2017/08/28
description: Detects the usage of Sysinternals Tools due to accepteula key being added
  to Registry
detection:
  condition: 1 of them
  selection2:
    winlog.event_data.CommandLine: '* -accepteula*'
falsepositives:
- Legitimate use of SysInternals tools
- Programs that use the same Registry Key
id: fde5badf-e718-4e00-9173-80c88d7c8a22
level: low
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/Moti_B/status/1008587936735035392
status: experimental
title: Usage of Sysinternals Tools
