author: Victor Sergeev, Daniil Yugoslavskiy, oscd.community
category: registry_event
date: 2019/10/21
description: Detects modification of autostart extensibility point (ASEP) in registry
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject|contains:
    - \software\Microsoft\Windows\CurrentVersion\Run
    - \software\Microsoft\Windows\CurrentVersion\RunOnce
    - \software\Microsoft\Windows\CurrentVersion\RunOnceEx
    - \software\Microsoft\Windows\CurrentVersion\RunServices
    - \software\Microsoft\Windows\CurrentVersion\RunServicesOnce
    - \software\Microsoft\Windows NT\CurrentVersion\Winlogon\Userinit
    - \software\Microsoft\Windows NT\CurrentVersion\Winlogon\Shell
    - \software\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_DLLs
    - \software\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_DLLs
    - \software\Microsoft\Windows NT\CurrentVersion\Windows\Load
    - \software\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Windows\Load
    - \software\Microsoft\Windows NT\CurrentVersion\Windows\Run
    - \software\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Windows\Run
    - \software\Microsoft\Windows\CurrentVersion\Explorer\User Shell Folders
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
id: 17f878b8-9968-4578-b814-c4217fc5768c
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2020/09/06
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1060/T1060.yaml
status: experimental
tags:
- attack.persistence
- attack.t1547.001
title: Autorun Keys Modification
