action: global
author: Florian Roth
category: registry_event
date: 2017/05/08
description: Detects the installation of a plugin DLL via ServerLevelPluginDll parameter
  in Registry, which can be used to execute code in context of the DNS server (restart
  required)
detection:
  condition: 1 of them
  dnsregmod:
    winlog.event_data.TargetObject: '*\services\DNS\Parameters\ServerLevelPluginDll'
falsepositives:
- unknown
fields:
- winlog.event_id
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.Image
- winlog.event_data.User
- winlog.event_data.TargetObject
id: 6559a8c4-d641-4646-a265-1e04664aa78a
level: high
logsource:
  category: registry_event
  product: windows
modified: 2020/09/06
product: windows
references:
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
status: experimental
tags:
- attack.defense_evasion
- attack.t1073
- attack.t1574.002
- attack.t1112
title: DNS ServerLevelPluginDll Install
