action: global
author: Florian Roth
category: registry_event
date: 2017/03/19
description: Detects UAC bypass method using Windows event viewer
detection:
  condition: methregistry
  methregistry:
    winlog.event_data.TargetObject: HKU\\*\mscfile\shell\open\command
falsepositives:
- unknown
id: e28b4d15-9db9-408a-9a90-1143099d3f89
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2020/09/06
product: windows
references:
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
- https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1088
- attack.t1548.002
- car.2019-04-001
title: UAC Bypass via Event Viewer
