author: Florian Roth, Markus Neis
category: proxy
date: 2019/11/12
description: Detects suspicious user agent strings used in APT malware in proxy logs
detection:
  condition: selection
  selection:
    http.http_user_agent:
    - webclient
    - hots scot
    - winlog.event_data.SJZJ (compatible; MSIE 6.0; Win32)
    - winlog.event_data.Mozilla/5.0 (Windows NT 6.; WOW64; rv:20.0) Gecko/20100101
      Firefox/20.0
    - 'winlog.event_data.User-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT
      6.1; Trident/4.0; SLCC'
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 7.4; Win32;32-bit)
    - winlog.event_data.Mozilla/5.0 (Windows; U; Windows NT 5.1; zh-EN; rv:1.7.12)
      Gecko/200
    - winlog.event_data.Mozilla/4.0 (compatible; MSI 6.0;
    - winlog.event_data.Mozilla/5.0 (Windows NT 6.3; WOW64; rv:28.0) Gecko/20100101
      Firefox/28.0
    - winlog.event_data.Mozilla/5.0 (Windows NT 6.2; WOW64; rv:20.0) Gecko/20100101
      Firefox/
    - winlog.event_data.Mozilla/5.0 (Windows NT 6.; WOW64; rv:20.0) Gecko/20100101
      Firefox/2
    - winlog.event_data.Mozilla/4.0
    - winlog.event_data.Netscape
    - winlog.event_data.Mozilla/5.0 (Windows; U; Windows NT 5.1; zh-EN; rv:1.7.12)
      Gecko/20100719 Firefox/1.0.7
    - winlog.event_data.Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.9.2.13)
      Firefox/3.6.13 GTB7.1
    - winlog.event_data.Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; WOW64;
      Trident/5.0)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1; WOW64;
      Trident/4.0; SLCC2; .NETCLR 2.0.50727)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.0; SV1)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 11.0; Windows NT 6.1; SV1)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 8.0; Win32)
    - winlog.event_data.Mozilla v5.1 (Windows NT 6.1; rv:6.0.1) Gecko/20100101 Firefox/6.0.1
    - winlog.event_data.Mozilla/6.1 (compatible; MSIE 9.0; Windows NT 5.3; Trident/5.0)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET
      CLR 1.1.4322; .NET CLR 2.0.50727; .NET CLR 3.0.04506.30; .NET CLR 3.0.04506.648;
      InfoPath.1)
    - winlog.event_data.Mozilla/5.0 (Windows NT 6.1; WOW64) WinHttp/1.6.3.8 (WinHTTP/5.1)
      like Gecko
    - winlog.event_data.Mozilla v5.1 *
    - winlog.event_data.MSIE 8.0
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; SLCC2;
      .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729; Media Center PC
      6.0; .NET4.0C; .NET4.0E; InfoPath.2)
    - winlog.event_data.Mozilla/4.0 (compatible; RMS)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 6.0; DynGate)
    - winlog.event_data.O/9.27 (W; U; Z)
    - winlog.event_data.Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.0; Trident/5.0;  Trident/5.0*
    - winlog.event_data.Mozilla/5.0 (Windows NT 9; *
    - winlog.event_data.Mozilla/5.0 (compatible; MSIE 10.0; Windows NT)
    - winlog.event_data.Mozilla/5.0 (Windows NT 6.1; WOW64) Chrome/28.0.1500.95 Safari/537.36
    - winlog.event_data.Mozilla/5.0 (Windows NT 6.2; Win32; rv:47.0)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1;SV1;
falsepositives:
- Old browsers
fields:
- src_ip
- http.url
- http.http_user_agent
id: 6ec820f2-e963-4801-9127-d8b2dce4d31b
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2020/09/03
product: suricata
references:
- Internal Research
service: http
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
title: APT User Agent
