author: Florian Roth
category: proxy
date: 2017/07/08
description: Detects suspicious user agent strings used by exploit / pentest framworks
  like Metasploit in proxy logs
detection:
  condition: selection
  selection:
    http.http_user_agent:
    - '*wordpress hash grabber*'
    - '*exploit*'
    - winlog.event_data.Internet Explorer *
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; InfoPath.2)
    - winlog.event_data.Mozilla/4.0 (compatible; Metasploit RSPEC)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 6.1; Windows NT)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.0; Trident/4.0)
    - winlog.event_data.Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0; Trident/4.0;
      SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E}; SLCC1; .N
    - winlog.event_data.Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)
    - winlog.event_data.Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US) AppleWebKit/525.13
      (KHTML, like Gecko) Chrome/4.0.221.6 Safari/525.13
    - winlog.event_data.Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; WOW64;
      Trident/5.0; MAAU)
    - winlog.event_data.Mozilla/5.0
    - winlog.event_data.Mozilla/4.0 (compatible; SPIPE/1.0
    - winlog.event_data.Mozilla/5.0 (Windows NT 6.3; rv:39.0) Gecko/20100101 Firefox/35.0
    - winlog.event_data.Sametime Community Agent
    - winlog.event_data.X-FORWARDED-FOR
    - winlog.event_data.DotDotPwn v2.1
    - winlog.event_data.SIPDROID
    - winlog.event_data.Mozilla/5.0 (Windows NT 10.0; Win32; x32; rv:60.0)
    - winlog.event_data.Mozilla/6.0 (X11; Linux x86_64; rv:24.0) Gecko/20140205     Firefox/27.0
      Iceweasel/25.3.0
falsepositives:
- Unknown
fields:
- src_ip
- http.url
- http.http_user_agent
id: fdd1bfb5-f60b-4a35-910e-f36ed3d0b32f
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2020/09/03
product: suricata
references:
- https://blog.didierstevens.com/2015/03/16/quickpost-metasploit-user-agent-strings/
service: http
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
title: Exploit Framework User Agent
