author: Cian Heasley
date: 2020/06/10
description: Detects Windows Pcap driver installation based on a list of associated
  .sys files.
detection:
  condition: selection
  selection:
    EventID: 4697
    winlog.event_data.ServiceFileName,:
    - '*pcap*'
    - '*npcap*'
    - '*npf*'
    - '*nm3*'
    - '*ndiscap*'
    - '*nmnt*'
    - '*windivert*'
    - '*USBPcap*'
    - '*pktmon*'
falsepositives:
- unknown
fields:
- winlog.event_data.EventID
- winlog.event_data.ServiceFileName,
- winlog.event_data.Account_Name
- winlog.event_data.Computer_Name
- winlog.event_data.Originating_Computer
- winlog.event_data.ServiceName,
id: 7b687634-ab20-11ea-bb37-0242ac130002
level: medium
logsource:
  product: windows
  service: system
product: windows
references:
- https://ragged-lab.blogspot.com/2020/06/capturing-pcap-driver-installations.html#more
service: system
status: experimental
tags:
- attack.discovery
- attack.credential_access
- attack.t1040
title: Windows Pcap Drivers
