author: "J\xE1n Tren\u010Dansk\xFD"
date: 2020/07/28
description: Detects disabling Windows Defender threat protection
detection:
  condition: 1 of them
  selection:
    EventID:
    - 5001
    - 5010
    - 5012
    - 5101
  selection2:
    winlog.event_data.Details,: DWORD (0x00000001)
    winlog.event_data.TargetObject,:
    - HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\WinDefend
    - HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows Defender
    - HKEY_LOCAL_MACHINE\SOFTWARE\Policies\Microsoft\Windows Defender
falsepositives:
- Administrator actions
id: fe34868f-6e0e-4882-81f6-c43aa8f15b62
level: high
logsource:
  product: windows
  service: windefend
product: windows
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus
service: windefend
status: stable
tags:
- attack.defense_evasion
- attack.t1089
- attack.t1562.001
title: Windows Defender Threat Detection Disabled
