action: global
author: Thomas Patzke
category: process_creation
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
  Sysmon)
detection:
  condition: 1 of them
  service_execution:
    EventID: 7036
    winlog.event_data.ServiceName,: PSEXESVC
  service_installation:
    EventID: 7045
    winlog.event_data.ServiceFileName,: '*\PSEXESVC.exe'
    winlog.event_data.ServiceName,: PSEXESVC
  sysmon_processcreation:
    winlog.event_data.Image,: '*\PSEXESVC.exe'
    winlog.event_data.User,: NT AUTHORITY\SYSTEM
falsepositives:
- unknown
fields:
- winlog.event_data.EventID
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
- winlog.event_data.ServiceName,
- winlog.event_data.ServiceFileName,
id: 6c1c404b-5474-4389-add1-fb89feb79572
level: low
logsource:
  category: process_creation
  product: windows
modified: 2020/08/23
product: windows
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
status: experimental
tags:
- attack.execution
- attack.t1035
- attack.t1569.002
- attack.s0029
title: PsExec Tool Execution
