author: faloker
date: 2020/02/11
description: Detects bulk downloading of User Data associated with AWS EC2 instances.
  Instance User Data may include installation scripts and hard-coded secrets for deployment.
detection:
  condition: all of them | count() > 10
  selection_eventname:
  - eventName: DescribeInstanceAttribute
  selection_requesttype:
  - requestParameters.attribute: userData
  selection_source:
  - eventSource: ec2.amazonaws.com
  timeframe: 30m
falsepositives:
- Assets management software like device42
id: 26ff4080-194e-47e7-9889-ef7602efed0c
level: medium
logsource:
  service: cloudtrail
modified: 2020/09/01
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/master/modules/ec2__download_userdata/main.py#L24
service: cloudtrail
status: experimental
tags:
- attack.exfiltration
- attack.t1020
title: AWS EC2 Download Userdata
