author: faloker
date: 2020/02/12
description: Detects the recovery of a new public database instance from a snapshot.
  It may be a part of data exfiltration.
detection:
  condition: all of them
  selection_eventname:
  - eventName: RestoreDBInstanceFromDBSnapshot
  selection_ispublic:
  - responseElements.publiclyAccessible: 'true'
  selection_source:
  - eventSource: rds.amazonaws.com
falsepositives:
- unknown
id: c3f265c7-ff03-4056-8ab2-d486227b4599
level: high
logsource:
  service: cloudtrail
modified: 2020/09/01
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/master/modules/rds__explore_snapshots/main.py#L10
service: cloudtrail
status: experimental
tags:
- attack.exfiltration
- attack.t1020
title: Restore Public AWS RDS Instance
