author: faloker
date: 2020/02/12
description: Detects the change of database master password. It may be a part of data
  exfiltration.
detection:
  condition: all of them
  selection_eventname:
  - eventName: ModifyDBInstance
  selection_modified_values:
  - responseElements.pendingModifiedValues.masterUserPassword: '*'
  selection_source:
  - eventSource: rds.amazonaws.com
falsepositives:
- Benign changes to a db instance
id: 8a63cdd4-6207-414a-85bc-7e032bd3c1a2
level: medium
logsource:
  service: cloudtrail
modified: 2020/09/01
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/master/modules/rds__explore_snapshots/main.py#L10
service: cloudtrail
status: experimental
tags:
- attack.exfiltration
- attack.t1020
title: AWS RDS Master Password Change
