author: Markus Neis
date: 2017/11/06
definition: Note that you have to configure logging for PipeEvents in Symson config
description: Detects a named pipe used by Turla group samples
detection:
  condition: selection
  selection:
    EventID:
    - 17
    - 18
    winlog.event_data.PipeName,:
    - \atctl
    - \userpipe
    - \iehelper
    - \sdlrpc
    - \comnap
falsepositives:
- Unkown
id: 739915e4-1e70-4778-8b8a-17db02f66db1
level: critical
logsource:
  definition: Note that you have to configure logging for PipeEvents in Symson config
  product: windows
  service: sysmon
product: windows
references:
- Internal Research
service: sysmon
status: experimental
tags:
- attack.g0010
title: Turla Group Named Pipes
