action: global
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
  using tunnelling techniques
detection:
  condition: selection and selection_1
  selection:
    winlog.event_id: 6
  selection_1:
    winlog.event_data.ImagePath|contains: tap0901
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: 9bf8e4e3-5dbe-45c7-b336-55c76a5dbb86
level: medium
logsource:
  product: windows
  service: sysmon
product: windows
service: sysmon
status: experimental
tags:
- attack.exfiltration
- attack.t1048
title: Tap Driver Installation
