author: Samir Bousseaden
date: 2019/04/03
description: Detects known sensitive file extensions accessed on a network share
detection:
  condition: selection
  selection:
    EventID:
    - 5145
    RelativeTargetName:
    - '*.pst'
    - '*.ost'
    - '*.msg'
    - '*.nst'
    - '*.oab'
    - '*.edb'
    - '*.nsf'
    - '*.bak'
    - '*.dmp'
    - '*.kirbi'
    - '*\groups.xml'
    - '*.rdp'
falsepositives:
- Help Desk operator doing backup or re-imaging end user machine or pentest or backup
  software
- Users working with these data types or exchanging message files
fields:
- winlog.ComputerName
- winlog.event_data.SubjectDomainName
- winlog.event_data.SubjectUserName
- winlog.event_data.RelativeTargetName
id: 91c945bc-2ad1-4799-a591-4d00198a1215
level: medium
logsource:
  product: windows
  service: security
modified: 2020/08/23
product: windows
service: security
tags:
- attack.collection
- attack.t1039
title: Suspicious Access to Sensitive File Extensions
