action: global
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
  using tunnelling techniques
detection:
  condition: selection and selection_1
  selection:
    winlog.event_id: 4697
  selection_1:
    winlog.event_data.ImagePath|contains: tap0901
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: fb25e843-def2-4d42-95ed-ea68094bae1e
level: medium
logsource:
  product: windows
  service: security
product: windows
service: security
status: experimental
tags:
- attack.exfiltration
- attack.t1048
title: Tap Driver Installation
