author: Florian Roth
date: 2020/02/29
description: Detects the exploitation of Microsoft Exchange vulnerability as described
  in CVE-2020-0688
detection:
  condition: selection1 and selection2
  selection1:
    EventID: 4
    Level: Error
    winlog.event_data.Source: MSExchange Control Panel
  selection2:
  - '*&__VIEWSTATE=*'
falsepositives:
- Unknown
id: d6266bf5-935e-4661-b477-78772735a7cb
level: high
logsource:
  product: windows
  service: application
product: windows
references:
- https://www.trustedsec.com/blog/detecting-cve-20200688-remote-code-execution-vulnerability-on-microsoft-exchange-server/
service: application
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: CVE-2020-0688 Exploitation via Eventlog
