author: Ilyas Ochkov, oscd.community
date: 2019/10/25
description: Detects possible bypass EDR and SIEM via abnormal user account name.
detection:
  condition: selection
  selection:
    UserName|contains: $
    winlog.event_id:
    - 4720
    - 4781
falsepositives:
- Unkown
fields:
- winlog.event_id
- winlog.event_data.UserName
- winlog.event_data.SubjectAccountName
id: cfeed607-6aa4-4bbd-9627-b637deb723c8
level: high
logsource:
  product: windows
  service: security
modified: 2019/11/13
product: windows
service: security
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
title: New or Renamed User Account with '$' in Attribute 'SamAccountName'.
