action: global
author: Florian Roth, Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community
date: 2017/03/05
description: Detects well-known credential dumping tools execution via service execution
  events
detection:
  condition: selection and selection_1
  selection:
    winlog.event_id: 6
  selection_1:
  - winlog.event_data.ServiceName|contains:
    - fgexec
    - wceservice
    - wce service
    - pwdump
    - gsecdump
    - cachedump
    - mimikatz
    - mimidrv
  - winlog.event_data.ImagePath|contains:
    - fgexec
    - dumpsvc
    - cachedump
    - mimidrv
    - gsecdump
    - servpw
    - pwdump
  - winlog.event_data.ImagePath|re: ((\\\\.*\\.*|.*\\)([{]?[0-9A-Fa-f]{8}-[0-9A-Fa-f]{4}-[0-9A-Fa-f]{4}-[0-9A-Fa-f]{4}-[0-9A-Fa-f]{12}[}])?\.(exe|scr|cpl|bat|js|cmd|vbs).*)
falsepositives:
- Legitimate Administrator using credential dumping tool for password recovery
id: ebed118f-b4dd-4ad1-9420-602c1826b4d0
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/08/23
product: windows
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
service: sysmon
tags:
- attack.credential_access
- attack.execution
- attack.t1003
- attack.t1003.001
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
- attack.t1003.006
- attack.t1035
- attack.t1569.002
- attack.s0005
title: Credential Dumping Tools Service Execution
