action: global
author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: 2019/11/08
description: "Detects all variations of obfuscated powershell IEX invocation code\
  \ generated by Invoke-Obfuscation framework from the following code block \u2014\
  \ https://github.com/danielbohannon/Invoke-Obfuscation/blob/master/Out-ObfuscatedStringCommand.ps1#L873-L888"
detection:
  condition: selection and selection_1
  selection:
    winlog.event_id: 4697
  selection_1:
  - winlog.event_data.ImagePath|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - winlog.event_data.ImagePath|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - winlog.event_data.ImagePath|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - winlog.event_data.ImagePath|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - winlog.event_data.ImagePath|re: \*mdr\*\W\s*\)\.Name
  - winlog.event_data.ImagePath|re: \$VerbosePreference\.ToString\(
  - winlog.event_data.ImagePath|re: \String\]\s*\$VerbosePreference
falsepositives:
- Unknown
id: 58ebe937-4497-4491-99e6-24ba398d0457
level: high
logsource:
  product: windows
  service: security
product: windows
service: security
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
title: Invoke-Obfuscation Obfuscated IEX Invocation
