action: global
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
  using tunnelling techniques
detection:
  condition: selection and selection_1
  selection:
    winlog.event_id: 7045
  selection_1:
    winlog.event_data.ImagePath|contains: tap0901
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: a86adc0e-ebe8-471a-96b9-7e1f712594d8
level: medium
logsource:
  product: windows
  service: system
product: windows
service: system
status: experimental
tags:
- attack.exfiltration
- attack.t1048
title: Tap Driver Installation
