action: global
author: Florian Roth
date: 2018/03/20
definition: 'Requirements: Audit Policy : Object Access > Audit Registry (Success)'
description: Detects NetNTLM downgrade attack
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.TargetObject:
    - '*SYSTEM\\*ControlSet*\Control\Lsa\lmcompatibilitylevel'
    - '*SYSTEM\\*ControlSet*\Control\Lsa*\NtlmMinClientSec'
    - '*SYSTEM\\*ControlSet*\Control\Lsa*\RestrictSendingNTLMTraffic'
    winlog.event_id: 13
  selection2:
    winlog.event_data.ObjectName: \REGISTRY\MACHINE\SYSTEM\\*ControlSet*\Control\Lsa*
    winlog.event_data.ObjectValueName:
    - LmCompatibilityLevel
    - NtlmMinClientSec
    - RestrictSendingNTLMTraffic
    winlog.event_id: 4657
falsepositives:
- Unknown
id: d67572a0-e2ec-45d6-b8db-c100d14b8fbb
level: critical
logsource:
  definition: 'Requirements: Audit Policy : Object Access > Audit Registry (Success)'
  product: windows
  service: security
modified: 2020/08/23
product: windows
references:
- https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
service: security
tags:
- attack.defense_evasion
- attack.t1562.001
- attack.t1112
title: NetNTLM Downgrade Attack
