author: Florian Roth
date: 2017/02/19
description: This detection method points out highly relevant Antivirus events
detection:
  condition: keywords and not 1 of filters
  filters:
    Message:
    - '*Keygen*'
    - '*Crack*'
  keywords:
    Message:
    - '*HTool*'
    - '*Hacktool*'
    - '*ASP/Backdoor*'
    - '*JSP/Backdoor*'
    - '*PHP/Backdoor*'
    - '*Backdoor.ASP*'
    - '*Backdoor.JSP*'
    - '*Backdoor.PHP*'
    - '*Webshell*'
    - '*Portscan*'
    - '*Mimikatz*'
    - '*WinCred*'
    - '*PlugX*'
    - '*Korplug*'
    - '*Pwdump*'
    - '*Chopper*'
    - '*WmiExec*'
    - '*Xscan*'
    - '*Clearlog*'
    - '*ASPXSpy*'
falsepositives:
- Some software piracy tools (key generators, cracks) are classified as hack tools
id: 78bc5783-81d9-4d73-ac97-59f6db4f72a8
level: high
logsource:
  product: windows
  service: application
product: windows
service: application
title: Relevant Anti-Virus Event
