author: Florian Roth, Daniil Yugoslavskiy, oscd.community (update)
date: 2017/03/27
description: Detects known malicious service installs that only appear in cases of
  lateral movement, credential dumping and other suspicious activity
detection:
  condition: selection and 1 of malsvc_*
  malsvc_paexec:
    winlog.event_data.ServiceFileName|contains: \PAExec
  malsvc_persistence:
    winlog.event_data.ServiceFileName|contains: net user
  malsvc_wannacry:
    winlog.event_data.ServiceName: mssecsvc2.0
  selection:
    winlog.event_id: 7045
falsepositives:
- Penetration testing
id: 5a105d34-05fc-401e-8553-272b45c1522d
level: critical
logsource:
  product: windows
  service: system
modified: 2019/11/01
product: windows
service: system
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1003
- attack.t1035
- attack.t1050
- car.2013-09-005
- attack.t1543.003
- attack.t1569.002
title: Malicious Service Installations
