action: global
author: Florian Roth
date: 2018/03/20
description: Detects NetNTLM downgrade attack
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.TargetObject:
    - '*SYSTEM\\*ControlSet*\Control\Lsa\lmcompatibilitylevel'
    - '*SYSTEM\\*ControlSet*\Control\Lsa*\NtlmMinClientSec'
    - '*SYSTEM\\*ControlSet*\Control\Lsa*\RestrictSendingNTLMTraffic'
    winlog.event_id: 13
falsepositives:
- Unknown
id: 43fb7eee-0726-49e7-83e4-a224ff2205de
level: critical
logsource:
  product: windows
  service: sysmon
modified: 2020/08/23
product: windows
references:
- https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
service: sysmon
tags:
- attack.defense_evasion
- attack.t1089
- attack.t1562.001
- attack.t1112
title: NetNTLM Downgrade Attack
