author: '@neu5ron'
date: 2017/07/30
definition: 'Requirements: Audit Policy : Account Management > Audit User Account
  Management, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
  Audit Policy Configuration\Audit Policies\Account Management\Audit User Account
  Management'
description: Detects scenario where weak encryption is enabled for a user profile
  which could be used for hash/password cracking.
detection:
  condition: selection and keywords and filters
  filters:
    Message:
    - '*Enabled*'
  keywords:
    Message:
    - '*DES*'
    - '*Preauth*'
    - '*Encrypted*'
  selection:
    winlog.event_id: 4738
falsepositives:
- Unknown
id: f6de9536-0441-4b3f-a646-f4e00f300ffd
level: high
logsource:
  definition: 'Requirements: Audit Policy : Account Management > Audit User Account
    Management, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
    Audit Policy Configuration\Audit Policies\Account Management\Audit User Account
    Management'
  product: windows
  service: security
product: windows
references:
- https://adsecurity.org/?p=2053
- https://www.harmj0y.net/blog/activedirectory/roasting-as-reps/
service: security
tags:
- attack.defense_evasion
- attack.t1089
- attack.t1562.001
title: Weak Encryption Enabled and Kerberoast
