author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/06/20
description: Detects tools extracting LSA secret DPAPI domain backup key from Domain
  Controllers
detection:
  condition: selection
  selection:
    EventID: 4662
    winlog.event_data.AccessMask: '0x2'
    winlog.event_data.ObjectName: BCKUPKEY
    winlog.event_data.ObjectType: SecretObject
falsepositives:
- Unknown
id: 4ac1f50b-3bd0-4968-902d-868b4647937e
level: critical
logsource:
  product: windows
  service: security
product: windows
references:
- https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/06_credential_access/T1003_credential_dumping/domain_dpapi_backupkey_extraction.md
service: security
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.004
title: DPAPI Domain Backup Key Extraction
