author: Florian Roth
date: 2018/06/08
definition: Reqiures events from Microsoft-Windows-NTLM/Operational
description: Detects logons using NTLM, which could be caused by a legacy source or
  attackers
detection:
  condition: selection
  selection:
    EventID: 8002
    winlog.event_data.CallingProcessName: '*'
falsepositives:
- Legacy hosts
id: 98c3bcf1-56f2-49dc-9d8d-c66cf190238b
level: low
logsource:
  definition: Reqiures events from Microsoft-Windows-NTLM/Operational
  product: windows
  service: ntlm
product: windows
references:
- https://twitter.com/JohnLaTwC/status/1004895028995477505
- https://goo.gl/PsqrhT
service: ntlm
status: experimental
tags:
- attack.lateral_movement
- attack.t1075
- attack.t1550.002
title: NTLM Logon
