author: Samir Bousseaden
date: 2019/04/03
definition: The advanced audit policy setting "Object Access > Audit Detailed File
  Share" must be configured for Success/Failure
description: detects execution of psexec or paexec with renamed service name, this
  rule helps to filter out the noise if psexec is used for legit purposes or if attacker
  uses a different psexec client other than sysinternal one
detection:
  condition: selection1 and not selection2
  selection1:
    EventID: 5145
    RelativeTargetName:
    - '*-stdin'
    - '*-stdout'
    - '*-stderr'
    winlog.event_data.ShareName: \\*\IPC$
  selection2:
    EventID: 5145
    RelativeTargetName: PSEXESVC*
    winlog.event_data.ShareName: \\*\IPC$
falsepositives:
- nothing observed so far
id: c462f537-a1e3-41a6-b5fc-b2c2cef9bf82
level: high
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
product: windows
references:
- https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
service: security
tags:
- attack.lateral_movement
- attack.t1077
- attack.t1021.002
title: Suspicious PsExec Execution
