author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/11
description: Detects potential use of CreateRemoteThread api and LoadLibrary function
  to inject DLL into a process
detection:
  condition: selection
  selection:
    EventID: 8
    StartFunction: LoadLibraryA
    winlog.event_data.StartModule|endswith: \kernel32.dll
falsepositives:
- Unknown
id: 052ec6f6-1adc-41e6-907a-f1c813478bee
level: critical
logsource:
  product: windows
  service: sysmon
modified: 2020/08/28
product: windows
references:
- https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/05_defense_evasion/T1055_process_injection/dll_injection_createremotethread_loadlibrary.md
service: sysmon
status: experimental
tags:
- attack.defense_evasion
- attack.t1055
- attack.t1055.001
title: CreateRemoteThread API and LoadLibrary
