author: Teymur Kheirkhabarov, oscd.community
date: 2019/11/01
description: Detects well-known credential dumping tools execution via specific named
  pipes
detection:
  condition: selection
  selection:
    winlog.event_data.PipeName|contains:
    - \lsadump
    - \cachedump
    - \wceservicepipe
    winlog.event_id: 17
falsepositives:
- Legitimate Administrator using tool for password recovery
id: 961d0ba2-3eea-4303-a930-2cf78bbfcc5e
level: critical
logsource:
  product: windows
  service: sysmon
modified: 2020/08/28
product: windows
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
service: sysmon
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
title: Cred Dump-Tools Named Pipes
