author: Tom Ueltschi (@c_APT_ure)
date: 2019/01/12
description: Detects creation of WMI event subscription persistence method
detection:
  condition: selector
  selector:
    EventID:
    - 19
    - 20
    - 21
falsepositives:
- exclude legitimate (vetted) use of WMI event subscription in your network
id: 0f06a3a5-6a09-413f-8743-e6cf35561297
level: high
logsource:
  product: windows
  service: sysmon
product: windows
service: sysmon
status: experimental
tags:
- attack.t1084
- attack.persistence
- attack.t1546.003
title: WMI Event Subscription
