action: global
author: Nik Seetharaman
date: 2018/07/16
description: Detects various indicators of Microsoft Connection Manager Profile Installer
  execution
detection:
  condition: 1 of them
  selection2:
    winlog.event_data.EventType: CreateKey
    winlog.event_data.TargetObject: '*\cmmgr32.exe*'
    winlog.event_id: 12
  selection3:
    winlog.event_data.TargetObject: '*\cmmgr32.exe*'
    winlog.event_id: 13
  selection4:
    winlog.event_data.CallTrace: '*cmlua.dll*'
    winlog.event_id: 10
falsepositives:
- Legitimate CMSTP use (unlikely in modern enterprise environments)
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.Details
id: 7daa9ae9-ae62-4db6-bffa-9baf12308cfa
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/08/28
product: windows
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
service: sysmon
status: stable
tags:
- attack.defense_evasion
- attack.execution
- attack.t1191
- attack.t1218.003
- attack.g0069
- car.2019-04-001
title: CMSTP Execution
