author: Florian Roth
date: 2019/04/15
description: Detects suspicious scripting in WMI Event Consumers
detection:
  condition: selection
  selection:
    Destination:
    - '*new-object system.net.webclient).downloadstring(*'
    - '*new-object system.net.webclient).downloadfile(*'
    - '*new-object net.webclient).downloadstring(*'
    - '*new-object net.webclient).downloadfile(*'
    - '* iex(*'
    - '*WScript.shell*'
    - '* -nop *'
    - '* -noprofile *'
    - '* -decode *'
    - '* -enc *'
    winlog.event_id: 20
falsepositives:
- Administrative scripts
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: fe21810c-2a8c-478f-8dd3-5a287fb2a0e0
level: high
logsource:
  product: windows
  service: sysmon
product: windows
references:
- https://in.security/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/
- https://github.com/Neo23x0/signature-base/blob/master/yara/gen_susp_lnk_files.yar#L19
service: sysmon
status: experimental
tags:
- attack.t1086
- attack.execution
- attack.t1059.005
title: Suspicious Scripting in a WMI Consumer
