author: Florian Roth
date: 2018/06/25
description: Detects PowerShell remote thread creation in Rundll32.exe
detection:
  condition: selection
  selection:
    winlog.event_data.SourceImage: '*\powershell.exe'
    winlog.event_data.TargetImage: '*\rundll32.exe'
    winlog.event_id: 8
falsepositives:
- Unkown
id: 99b97608-3e21-4bfe-8217-2a127c396a0e
level: high
logsource:
  product: windows
  service: sysmon
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2018/06/bring-your-own-land-novel-red-teaming-technique.html
service: sysmon
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.011
- attack.t1059.001
title: PowerShell Rundll32 Remote Thread Creation
