author: Florian Roth, @0xrawsec
date: 2018/06/03
definition: 'Requirements: Sysmon config with Imphash logging activated'
description: Detects the creation of an ADS data stream that contains an executable
  (non-empty imphash)
detection:
  condition: selection and not 1 of filter*
  filter1:
    winlog.event_data.Imphash: '00000000000000000000000000000000'
  filter2:
    winlog.event_data.Imphash: null
  selection:
    EventID: 15
falsepositives:
- unknown
fields:
- winlog.event_data.TargetFilename
- winlog.event_data.Image
id: b69888d4-380c-45ce-9cf9-d9ce46e67821
level: critical
logsource:
  definition: 'Requirements: Sysmon config with Imphash logging activated'
  product: windows
  service: sysmon
modified: 2020/08/26
product: windows
references:
- https://twitter.com/0xrawsec/status/1002478725605273600?s=21
service: sysmon
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.s0139
- attack.t1564.004
title: Executable in ADS
