author: Thomas Patzke
date: 2017/02/19
description: Detects password dumper activity by monitoring remote thread creation
  EventID 8 in combination with the lsass.exe process as TargetImage. The process
  in field Process is the malicious program. A single execution can lead to hundreds
  of events.
detection:
  condition: selection
  selection:
    winlog.event_data.StartModule: ''
    winlog.event_data.TargetImage: C:\Windows\System32\lsass.exe
    winlog.event_id: 8
falsepositives:
- unknown
id: f239b326-2f41-4d6b-9dfa-c846a60ef505
level: high
logsource:
  product: windows
  service: sysmon
product: windows
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm
service: sysmon
status: stable
tags:
- attack.credential_access
- attack.s0005
- attack.t1003.001
title: Password Dumper Remote Thread in LSASS
