action: global
author: Florian Roth
date: 2019/12/22
description: 'PoC rule to detect malicious activity - following the principle: if
  you had only one shot, what would you look for?'
detection:
  condition: 1 of them
  selection_file_creation:
    EventID: 11
    winlog.event_data.TargetFilename|contains:
    - .dmp
    - Desktop\how
    - Desktop\decrypt
  selection_registry_modifications:
    EventID:
    - 12
    - 13
    winlog.event_data.TargetObject|contains:
    - UserInitMprLogonScript
    - \CurrentVersion\Image File Execution Options\
  selection_registry_run:
    EventID:
    - 12
    - 13
    winlog.event_data.Details|contains:
    - AppData
    - \Users\Public\
    - \Temp\
    - powershell
    - wscript
    - cscript
    winlog.event_data.TargetObject|contains:
    - \Microsoft\Windows\CurrentVersion\Run\
    - \Microsoft\Windows\CurrentVersion\RunOnce\
id: 7ebc6040-48b7-4e99-a6d5-88fd2eb43365
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/05/18
product: windows
service: sysmon
status: experimental
title: Godmode Sigma Rule
