action: global
author: Florian Roth
date: 2019/12/22
description: 'PoC rule to detect malicious activity - following the principle: if
  you had only one shot, what would you look for?'
detection:
  condition: 1 of them
  selection_file_creation:
    winlog.event_data.TargetFilename|contains:
    - .dmp
    - Desktop\how
    - Desktop\decrypt
    winlog.event_id: 11
  selection_registry_modifications:
    winlog.event_data.TargetObject|contains:
    - UserInitMprLogonScript
    - \CurrentVersion\Image File Execution Options\
    winlog.event_id:
    - 12
    - 13
  selection_registry_run:
    winlog.event_data.Details|contains:
    - AppData
    - \Users\Public\
    - \Temp\
    - powershell
    - wscript
    - cscript
    winlog.event_data.TargetObject|contains:
    - \Microsoft\Windows\CurrentVersion\Run\
    - \Microsoft\Windows\CurrentVersion\RunOnce\
    winlog.event_id:
    - 12
    - 13
id: d1b4cc47-5854-4e70-9ecb-23fa369ee3b5
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/05/18
product: windows
service: sysmon
status: experimental
title: Godmode Sigma Rule
