action: global
author: Florian Roth
date: 2019/12/22
description: 'PoC rule to detect malicious activity - following the principle: if
  you had only one shot, what would you look for?'
detection:
  condition: 1 of them
  selection:
    EventID: 7045
    winlog.event_data.ServiceName|contains:
    - WCESERVICE
    - WCE SERVICE
    - winexesvc
    - DumpSvc
    - pwdump
    - gsecdump
    - cachedump
id: 59732f19-e718-450c-a70c-0a19f91e0ef5
level: high
logsource:
  product: windows
  service: system
modified: 2020/05/18
product: windows
service: system
status: experimental
title: Godmode Sigma Rule
