action: global
author: Florian Roth
date: 2019/12/22
description: 'PoC rule to detect malicious activity - following the principle: if
  you had only one shot, what would you look for?'
detection:
  condition: 1 of them
  selection:
    winlog.event_data.ServiceName|contains:
    - WCESERVICE
    - WCE SERVICE
    - winexesvc
    - DumpSvc
    - pwdump
    - gsecdump
    - cachedump
    winlog.event_id: 7045
id: ebd42bc4-2fc4-4a7b-9b83-f92b29f44a86
level: high
logsource:
  product: windows
  service: system
modified: 2020/05/18
product: windows
service: system
status: experimental
title: Godmode Sigma Rule
