action: global
author: Florian Roth
date: 2019/12/22
description: 'PoC rule to detect malicious activity - following the principle: if
  you had only one shot, what would you look for?'
detection:
  condition: 1 of them
  selection_file_creation:
    winlog.event_data.TargetFilename|contains:
    - .dmp
    - winlog.event_data.Desktop\how
    - winlog.event_data.Desktop\decrypt
    winlog.event_id: 11
  selection_registry_modifications:
    winlog.event_data.TargetObject|contains:
    - \CurrentVersion\Image File Execution Options\
    - winlog.event_data.UserInitMprLogonScript
    winlog.event_id:
    - 12
    - 13
  selection_registry_run:
    winlog.event_data.Details|contains:
    - \Users\Public\
    - \Temp\
    - powershell
    - wscript
    - cscript
    - winlog.event_data.AppData
    winlog.event_data.TargetObject|contains:
    - \Microsoft\Windows\CurrentVersion\Run\
    - \Microsoft\Windows\CurrentVersion\RunOnce\
    winlog.event_id:
    - 12
    - 13
id: e29d2dbc-3d08-4116-813a-1c0af4b7be28
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/05/18
product: windows
service: sysmon
status: experimental
title: Godmode Sigma Rule
