action: global
author: Florian Roth
date: 2019/12/22
description: 'PoC rule to detect malicious activity - following the principle: if
  you had only one shot, what would you look for?'
detection:
  condition: 1 of them
  selection:
    winlog.event_data.ServiceName|contains:
    - winexesvc
    - pwdump
    - gsecdump
    - cachedump
    - winlog.event_data.WCESERVICE
    - winlog.event_data.WCE SERVICE
    - winlog.event_data.DumpSvc
    winlog.event_id: 7045
id: d56322aa-45d7-4791-9ce9-28cb6bc33fed
level: high
logsource:
  product: windows
  service: system
modified: 2020/05/18
product: windows
service: system
status: experimental
title: Godmode Sigma Rule
