action: global
author: Florian Roth
category: process_creation
date: 2020/02/04
description: Detects the use of Dumpert process dumper, which dumps the lsass.exe
  process memory
detection:
  condition: selection
  selection:
    winlog.event_data.Imphash: 09D278F9DE118EF09163C6140255C690
falsepositives:
- Very unlikely
id: 1a448514-c5c3-4a77-9ce7-974715ede608
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/08/23
product: windows
references:
- https://github.com/outflanknl/Dumpert
- https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
title: Dumpert Process Dumper
