action: global
author: Florian Roth
category: file_event
date: 2020/02/04
description: Detects the use of Dumpert process dumper, which dumps the lsass.exe
  process memory
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename: C:\Windows\Temp\dumpert.dmp
falsepositives:
- Very unlikely
id: 7fc3a13b-fb68-4bfd-9212-13380c03632a
level: critical
logsource:
  category: file_event
  product: windows
modified: 2020/08/23
product: windows
references:
- https://github.com/outflanknl/Dumpert
- https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.001
title: Dumpert Process Dumper
