author: Samir Bousseaden
category: process_access
date: 2019/04/03
description: Detects process LSASS memory dump using procdump or taskmgr based on
  the CallTrace pointing to dbghelp.dll or dbgcore.dll for win10
detection:
  condition: selection
  selection:
    winlog.event_data.CallTrace:
    - '*dbghelp.dll*'
    - '*dbgcore.dll*'
    winlog.event_data.GrantedAccess: '0x1fffff'
    winlog.event_data.TargetImage: C:\windows\system32\lsass.exe
falsepositives:
- unknown
id: 5ef9853e-4d0e-4a70-846f-a9ca37d876da
level: high
logsource:
  category: process_access
  product: windows
modified: 2020/08/24
product: windows
references:
- https://blog.menasec.net/2019/02/threat-hunting-21-procdump-or-taskmgr.html
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003
- attack.s0002
title: LSASS Memory Dump
