action: global
author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: 2019/11/08
description: "Detects all variations of obfuscated powershell IEX invocation code\
  \ generated by Invoke-Obfuscation framework from the following code block \u2014\
  \ https://github.com/danielbohannon/Invoke-Obfuscation/blob/master/Out-ObfuscatedStringCommand.ps1#L873-L888"
detection:
  condition: selection and selection_1
  selection:
    EventID: 7045
  selection_1:
  - ImagePath|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - ImagePath|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - ImagePath|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - ImagePath|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - ImagePath|re: \*mdr\*\W\s*\)\.Name
  - ImagePath|re: \$VerbosePreference\.ToString\(
  - ImagePath|re: \String\]\s*\$VerbosePreference
falsepositives:
- Unknown
id: d3e4b786-3acc-4896-8c42-485a89b615b2
level: high
logsource:
  product: windows
  service: system
product: windows
service: system
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
title: Invoke-Obfuscation Obfuscated IEX Invocation
