author: Florian Roth
date: 2017/02/19
description: Some threat groups tend to delete the local 'Security' Eventlog using
  certain utitlities
detection:
  condition: selection
  selection:
    EventID:
    - 517
    - 1102
falsepositives:
- Rollout of log collection agents (the setup routine often includes a reset of the
  local Eventlog)
- System provisioning (system reset before the golden image creation)
id: f2f01843-e7b8-4f95-a35a-d23584476423
level: high
logsource:
  product: windows
  service: security
modified: 2020/08/23
product: windows
service: security
tags:
- attack.defense_evasion
- attack.t1070
- attack.t1070.001
- car.2016-04-002
title: Security Eventlog Cleared
