author: Mike Wade
category: dns
date: 2020/09/16
description: Detects wannacry killswitch domain dns queries
detection:
  condition: selection
  selection:
    query:
    - ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.testing
    - ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.test
    - ifferfsodp9ifjaposdfjhgosurijfaewrwergwea.com
    - ayylmaotjhsstasdfasdfasdfasdfasdfasdfasdf.com
    - iuqssfsodp9ifjaposdfjhgosurijfaewrwergwea.com
    - ''
falsepositives:
- Analyst testing
id: c64c5175-5189-431b-a55e-6d9882158251
level: high
logsource:
  category: dns
  product: suricata
  service: dns
product: suricata
references:
- https://www.fireeye.com/blog/products-and-services/2017/05/wannacry-ransomware-campaign.html
service: dns
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
title: Wannacry Killswitch Domain
