action: global
author: Nik Seetharaman
category: process_creation
date: 2018/07/16
description: Detects various indicators of Microsoft Connection Manager Profile Installer
  execution
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.ParentImage,: '*\cmstp.exe'
falsepositives:
- Legitimate CMSTP use (unlikely in modern enterprise environments)
fields:
- winlog.event_data.CommandLine,
- winlog.event_data.ParentCommandLine,
- winlog.event_data.Details,
id: 8886ecd0-f394-4014-a9fd-302f3c347c50
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/24
product: windows
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
status: stable
tags:
- attack.defense_evasion
- attack.t1218.003
- attack.t1191
- attack.execution
- attack.t1559.001
- attack.t1175
- attack.g0069
- attack.g0080
- car.2019-04-001
title: CMSTP Execution
