author: HieuTT35
date: 2019/10/24
description: Detects a change in profile.ps1 of the Powershell profile
detection:
  condition: event and (target1 or target2)
  event:
    EventID: 11
  target1:
    winlog.event_data.TargetFilename,|contains|all:
    - \My Documents\PowerShell\
    - \profile.ps1
  target2:
    winlog.event_data.TargetFilename,|contains|all:
    - C:\Windows\System32\WindowsPowerShell\v1.0\
    - \profile.ps1
falsepositives:
- System administrator create Powershell profile manually
id: b5b78988-486d-4a80-b991-930eff3ff8bf
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/08/24
product: windows
references:
- https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/
service: sysmon
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.013
title: Powershell Profile.ps1 Modification
