author: Florian Roth
category: dns
date: 2018/05/10
description: Detects suspicious DNS queries known from Cobalt Strike beacons
detection:
  condition: selection
  selection:
    query:
    - aaa.stage.*
    - post.1*
falsepositives:
- Unknown
id: 2975af79-28c4-4d2f-a951-9095f229df29
level: high
logsource:
  category: dns
  product: suricata
  service: dns
modified: 2020/08/27
product: suricata
references:
- https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
service: dns
status: experimental
tags:
- attack.command_and_control
- attack.t1071
- attack.t1071.004
title: Cobalt Strike DNS Beaconing
