author: Ilyas Ochkov, oscd.community
category: registry_event
date: 2019/10/25
description: Detects the addition of a key 'MiniNt' to the registry. Upon a reboot,
  Windows Event Log service will stopped write events.
detection:
  condition: selection
  selection:
  - EventType: CreateKey
    TargetObject: HKLM\SYSTEM\CurrentControlSet\Control\MiniNt
  - NewName: HKLM\SYSTEM\CurrentControlSet\Control\MiniNt
falsepositives:
- Unkown
fields:
- winlog.event_data.EventID
- winlog.event_data.Image,
- winlog.event_data.TargetObject,
- winlog.event_data.NewName
id: 919f2ef0-be2d-4a7a-b635-eb2b41fde044
level: high
logsource:
  category: registry_event
  product: windows
modified: 2019/11/13
product: windows
references:
- https://twitter.com/0gtweet/status/1182516740955226112
status: experimental
tags:
- attack.defense_evasion
- attack.t1089
- attack.t1562.001
- attack.t1112
title: Disable Security Events Logging Adding Reg Key MiniNt
