author: Michael Haag, Florian Roth, juju4
category: process_creation
date: 2019/01/16
description: Detects WMI executing suspicious commands
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine:
    - '*/NODE:*process call create *'
    - '* path AntiVirusProduct get *'
    - '* path FirewallProduct get *'
    - '* shadowcopy delete *'
    winlog.event_data.Image:
    - '*\wmic.exe'
falsepositives:
- If using Splunk, we recommend | stats count by Computer,CommandLine following for
  easy hunting by Computer/CommandLine
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 526be59f-a573-4eea-b5f7-f0973207634d
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://digital-forensics.sans.org/blog/2010/06/04/wmic-draft/
- https://www.hybrid-analysis.com/sample/4be06ecd234e2110bd615649fe4a6fa95403979acf889d7e45a78985eb50acf9?environmentId=1
- https://blog.malwarebytes.com/threat-analysis/2016/04/rokku-ransomware/
status: experimental
tags:
- attack.execution
- attack.t1047
- car.2016-03-002
title: Suspicious WMI Execution
