action: global
author: Aleksey Potapov, oscd.community
date: 2019/10/22
description: Detects SILENTTRINITY stager use
detection:
  condition: selection
  selection:
    EventID: 7
falsepositives:
- unknown
id: 8e4080e1-d607-405e-9264-b700c31821d1
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/09/06
product: windows
references:
- https://github.com/byt3bl33d3r/SILENTTRINITY
service: sysmon
status: experimental
tags:
- attack.command_and_control
title: SILENTTRINITY Stager Execution
