author: Roberto Rodriguez @Cyb3rWard0g
category: process_creation
date: 2019/09/12
description: Detects remote PowerShell sections by monitoring for wsmprovhost as a
  parent or child process (sign of an active ps remote session)
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: \wsmprovhost.exe
  - winlog.event_data.ParentImage|endswith: \wsmprovhost.exe
falsepositives:
- Legitimate usage of remote Powershell, e.g. for monitoring purposes
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 734f8d9b-42b8-41b2-bcf5-abaf49d5a3c8
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2019/11/10
product: windows
references:
- https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/powershell_remote_session.md
status: experimental
tags:
- attack.execution
- attack.t1086
- attack.t1059.001
title: Remote PowerShell Session
