author: Jakob Weinzettl, oscd.community
category: process_creation
date: 2019/10/23
description: Detects a discovery of domain trusts
detection:
  condition: selection
  selection:
  - winlog.event_data.CommandLine|contains|all:
    - -filter
    - trustedDomain
    winlog.event_data.Image|endswith: \dsquery.exe
  - winlog.event_data.CommandLine|contains: domain_trusts
    winlog.event_data.Image|endswith: \nltest.exe
falsepositives:
- Administration of systems
id: 77815820-246c-47b8-9741-e0def3f57308
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2019/11/08
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1482/T1482.yaml
status: experimental
tags:
- attack.discovery
- attack.t1482
title: Domain Trust Discovery
