action: global
author: '@41thexplorer, Microsoft Defender ATP'
category: process_creation
date: 2018/11/20
description: A sigma rule detecting an unidetefied attacker who used phishing emails
  to target high profile orgs on November 2018. The Actor shares some TTPs with YYTRIUM/APT29
  campaign in 2016.
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine: '*cyzfc.dat, PointFunctionCall'
id: ccf410b4-00fe-44f0-97cc-a8ea4400c753
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/26
product: windows
references:
- https://twitter.com/DrunkBinary/status/1063075530180886529
status: stable
tags:
- attack.execution
- attack.t1218.011
- attack.t1085
title: Unidentified Attacker November 2018
