action: global
author: Tim Burrell
category: process_creation
date: 2020/02/07
description: Detects artefacts associated with activity group GALLIUM - Microsoft
  Threat Intelligence Center indicators released in December 2019.
detection:
  condition: legitimate_executable and not legitimate_process_path
  legitimate_executable:
    sha1:
    - e570585edc69f9074cb5e8a790708336bd45ca0f
  legitimate_process_path:
    winlog.event_data.Image|contains:
    - :\Program Files(x86)\
    - :\Program Files\
falsepositives:
- unknown
id: db9af1c6-18e3-4a18-a92d-eea7490d9504
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.microsoft.com/security/blog/2019/12/12/gallium-targeting-global-telecom/
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/dn800669(v=ws.11)
status: experimental
tags:
- attack.credential_access
- attack.command_and_control
title: GALLIUM Artefacts
