action: global
author: Tim Burrell
date: 2020/02/07
description: Detects artefacts associated with activity group GALLIUM - Microsoft
  Threat Intelligence Center indicators released in December 2019.
detection:
  c2_selection:
    EventID: 257
    QNAME:
    - asyspy256.ddns.net
    - hotkillmail9sddcc.ddns.net
    - rosaf112.ddns.net
    - cvdfhjh1231.myftp.biz
    - sz2016rose.ddns.net
    - dffwescwer4325.myftp.biz
    - cvdfhjh1231.ddns.net
  condition: c2_selection
falsepositives:
- unknown
id: 70cb9a53-6953-4d0d-aa0e-281795247725
level: high
logsource:
  product: windows
  service: dns-server
product: windows
references:
- https://www.microsoft.com/security/blog/2019/12/12/gallium-targeting-global-telecom/
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/dn800669(v=ws.11)
service: dns-server
status: experimental
tags:
- attack.credential_access
- attack.command_and_control
title: GALLIUM Artefacts
