author: Andreas Hunkeler (@Karneades)
category: process_creation
date: 2020/04/20
description: Detect the harvesting of wifi credentials using netsh.exe
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine:
    - netsh wlan s* p* k*=clear
falsepositives:
- Legitimate administrator or user uses netsh.exe wlan functionality for legitimate
  reason
id: 42b1a5b8-353f-4f10-b256-39de4467faff
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://blog.malwarebytes.com/threat-analysis/2020/04/new-agenttesla-variant-steals-wifi-credentials/
status: experimental
tags:
- attack.discovery
- attack.credential_access
- attack.t1040
title: Harvesting of Wifi Credentials Using netsh.exe
