action: global
author: Aleksey Potapov, oscd.community
date: 2019/10/22
description: Detects SILENTTRINITY stager use
detection:
  condition: selection
  selection:
    winlog.event_id: 7
falsepositives:
- unknown
id: 6bed8f46-6454-4a54-bc45-2e5ce21ee7f3
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/09/06
product: windows
references:
- https://github.com/byt3bl33d3r/SILENTTRINITY
service: sysmon
status: experimental
tags:
- attack.command_and_control
title: SILENTTRINITY Stager Execution
