author: '@neu5ron'
category: process_creation
date: 2019/02/07
description: Detects, possibly, malicious unauthorized usage of bcdedit.exe
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine:
    - '*delete*'
    - '*deletevalue*'
    - '*import*'
    winlog.event_data.Image: '*\bcdedit.exe'
id: c9fbe8e9-119d-40a6-9b59-dd58a5d84429
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/bcdedit--set
status: experimental
tags:
- attack.defense_evasion
- attack.t1070
- attack.persistence
- attack.t1542.003
- attack.t1067
title: Possible Ransomware or Unauthorized MBR Modifications
