analysis:
  recommendation: Check if the user that executed the commands is suspicious (e.g.
    service accounts, LOCAL_SYSTEM)
author: Florian Roth
category: process_creation
date: 2019/01/16
description: Detects suspicious command line activity on Windows systems
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine:
    - net group "domain admins" /domain
    - net localgroup administrators
falsepositives:
- Inventory tool runs
- Penetration tests
- Administrative activity
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: d95de845-b83c-4a9a-8a6a-4fc802ebf6c0
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/08/28
product: windows
status: experimental
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
title: Suspicious Reconnaissance Activity
