author: Florian Roth
category: process_creation
date: 2017/10/14
description: Detects process starts of binaries from a suspicious folder
detection:
  condition: selection
  selection:
    winlog.event_data.Image:
    - '*\RSA\MachineKeys\\*'
    - winlog.event_data.C:\PerfLogs\\*
    - winlog.event_data.C:\$Recycle.bin\\*
    - winlog.event_data.C:\Intel\Logs\\*
    - winlog.event_data.C:\Users\Default\\*
    - winlog.event_data.C:\Users\Public\\*
    - winlog.event_data.C:\Users\NetworkService\\*
    - winlog.event_data.C:\Windows\Fonts\\*
    - winlog.event_data.C:\Windows\Debug\\*
    - winlog.event_data.C:\Windows\Media\\*
    - winlog.event_data.C:\Windows\Help\\*
    - winlog.event_data.C:\Windows\addins\\*
    - winlog.event_data.C:\Windows\repair\\*
    - winlog.event_data.C:\Windows\security\\*
    - winlog.event_data.C:\Windows\system32\config\systemprofile\\*
    - winlog.event_data.C:\Windows\Tasks\\*
    - winlog.event_data.C:\Windows\System32\Tasks\\*
falsepositives:
- Unknown
id: 7a38aa19-86a9-4af7-ac51-6bfe4e59f254
level: high
logsource:
  category: process_creation
  product: windows
modified: 2019/02/21
product: windows
references:
- https://github.com/mbevilacqua/appcompatprocessor/blob/master/AppCompatSearch.txt
- https://www.secureworks.com/research/bronze-butler-targets-japanese-businesses
- https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/
- https://github.com/ThreatHuntingProject/ThreatHunting/blob/master/hunts/suspicious_process_creation_via_windows_event_logs.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
title: Executables Started in Suspicious Folder
