author: Florian Roth
category: process_creation
date: 2019/10/14
description: Detects a code page switch in command line or batch scripts to a rare
  language
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine:
    - chcp* 936
    - chcp* 1258
falsepositives:
- Administrative activity (adjust code pages according to your organisation's region)
fields:
- winlog.event_data.ParentCommandLine
id: c7942406-33dd-4377-a564-0f62db0593a3
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
- https://twitter.com/cglyer/status/1183756892952248325
status: experimental
title: Suspicious Code Page Switch
