action: global
author: Florian Roth
category: process_creation
date: 2019/12/22
description: Detects the use of CreateMiniDump hack tool used to dump the LSASS process
  memory for credential extraction on the attacker's machine
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.Image|contains: \CreateMiniDump.exe
  selection2:
    winlog.event_data.Imphash: 4a07f944a83e8a7c2525efa35dd30e2f
falsepositives:
- Unknown
id: 8fdbba67-b84c-4c1e-a335-47c4f51fd29a
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsass-passwords-without-mimikatz-minidumpwritedump-av-signature-bypass
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003
title: CreateMiniDump Hacktool
