action: global
author: Florian Roth
category: process_creation
date: 2019/03/04
description: Detects the deactivation of the Scheduled defragmentation task as seen
  by Slingshot APT group
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine:
    - '*schtasks* /delete *Defrag\ScheduledDefrag*'
falsepositives:
- Unknown
id: b2e10471-8aed-4fe0-922a-68d1bcd68010
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/08/27
product: windows
references:
- https://securelist.com/apt-slingshot/84312/
tags:
- attack.persistence
- attack.s0111
title: Defrag Deactivation
