author: '@neu5ron, Florian Roth'
category: process_creation
date: 2019/03/22
description: Detects a command that clears or disables any ETW trace log which could
  indicate a logging evasion.
detection:
  condition: selection_clear_1 or selection_clear_2 or selection_disable_1 or selection_disable_2
  selection_clear_1:
    winlog.event_data.CommandLine: '* cl */Trace*'
  selection_clear_2:
    winlog.event_data.CommandLine: '* clear-log */Trace*'
  selection_disable_1:
    winlog.event_data.CommandLine: '* sl* /e:false*'
  selection_disable_2:
    winlog.event_data.CommandLine: '* set-log* /e:false*'
falsepositives:
- Unknown
id: a238b5d0-ce2d-4414-a676-7a531b3d13d6
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
- https://github.com/Neo23x0/sigma/blob/master/rules/windows/process_creation/win_mal_lockergoga.yml
- https://abuse.io/lockergoga.txt
status: experimental
tags:
- attack.defense_evasion
- attack.t1070
- attack.t1562.006
- car.2016-04-002
title: Disable of ETW Trace
