action: global
author: '@41thexplorer, Microsoft Defender ATP'
date: 2018/11/20
description: A sigma rule detecting an unidetefied attacker who used phishing emails
  to target high profile orgs on November 2018. The Actor shares some TTPs with YYTRIUM/APT29
  campaign in 2016.
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine: '*cyzfc.dat, PointFunctionCall'
  selection2:
    winlog.event_data.TargetFilename:
    - '*ds7002.lnk*'
    winlog.event_id: 11
id: 7453575c-a747-40b9-839b-125a0aae32b0
level: high
logsource:
  product: windows
  service: sysmon
modified: 2020/08/26
product: windows
references:
- https://twitter.com/DrunkBinary/status/1063075530180886529
service: sysmon
status: stable
tags:
- attack.execution
- attack.t1218.011
title: Unidentified Attacker November 2018
