action: global
author: Florian Roth
date: 2019/03/04
definition: 'Requirements: Audit Policy : Audit Other Object Access Events > Success'
description: Detects the deactivation of the Scheduled defragmentation task as seen
  by Slingshot APT group
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine:
    - '*schtasks* /delete *Defrag\ScheduledDefrag*'
  selection2:
    TaskName: \Microsoft\Windows\Defrag\ScheduledDefrag
    winlog.event_id: 4701
falsepositives:
- Unknown
id: 72ebdd75-ad3b-48bf-af46-9e13ef739530
level: medium
logsource:
  definition: 'Requirements: Audit Policy : Audit Other Object Access Events > Success'
  product: windows
  service: security
modified: 2020/08/27
product: windows
references:
- https://securelist.com/apt-slingshot/84312/
service: security
tags:
- attack.persistence
- attack.s0111
title: Defrag Deactivation
