action: global
author: Florian Roth, Markus Neis
category: process_creation
date: 2018/03/23
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report
  in March 2018
detection:
  condition: 1 of them
  selection_process1:
    winlog.event_data.CommandLine:
    - '*\Service.exe i'
    - '*\Service.exe u'
    - '*\microsoft\Taskbar\autoit3.exe'
    - C:\wsc.exe*
  selection_process2:
    winlog.event_data.Image: '*\Windows\Temp\DB\\*.exe'
  selection_process3:
    winlog.event_data.CommandLine: '*\nslookup.exe -q=TXT*'
    winlog.event_data.ParentImage: '*\Autoit*'
  selection_reg1:
    EventID: 13
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject:
    - '*SOFTWARE\Microsoft\Windows\CurrentVersion\UMe'
    - '*SOFTWARE\Microsoft\Windows\CurrentVersion\UT'
  selection_reg2:
    EventID: 13
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject: '*\Control\SecurityProviders\WDigest\UseLogonCredential'
  selection_service:
    EventID: 4698
    TaskName:
    - SC Scheduled Scan
    - UpdatMachine
falsepositives:
- Unknown
id: 511b00b6-de44-41ff-881f-fb871534d6b3
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/08/26
product: windows
references:
- https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
tags:
- attack.persistence
- attack.g0049
- attack.t1053
- attack.t1053.005
- attack.s0111
- attack.t1050
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071
- attack.t1071.004
title: Chafer Activity
