author: Roberto Rodriguez @Cyb3rWard0g (rule), oscd.community (improvements)
category: process_creation
date: 2019/09/12
description: Detects non-interactive PowerShell activity by looking at powershell.exe
  with not explorer.exe as a parent.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ParentImage|endswith: \explorer.exe
  selection:
    winlog.event_data.Image|endswith: \powershell.exe
falsepositives:
- Legitimate programs executing PowerShell scripts
id: f4bbd493-b796-416e-bbf2-121235348529
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2019/11/10
product: windows
references:
- https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/basic_powershell_execution.md
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Non Interactive PowerShell
