author: FPT.EagleEye Team
date: 2020/09/26
description: Detects the execution of a AdFind for Active Directory enumeration
detection:
  condition: selection
  selection:
    ProcessCommandline|contains: objectcategory
    winlog.event_data.Image:
    - '*\adfind.exe'
falsepositives:
- Administrative activity
id: 75df3b17-8bcc-4565-b89b-c9898acef911
level: medium
logsource:
  product: windows
  service: process_creation
product: windows
references:
- https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
- https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/master/fin6/Emulation_Plan/Phase1.md
service: process_creation
status: experimental
tags:
- attack.discovery
- attack.t1016
- attack.t1018
- attack.t1482
title: Suspicious AdFind Execution
