author: Sander Wiebing
category: process_creation
date: 2020/05/25
description: Detects Netsh commands that allows a suspcious application location on
  Windows Firewall
detection:
  condition: (selection1 or selection2) and susp_image
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - netsh
    - firewall add allowedprogram
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - netsh
    - advfirewall firewall add rule
    - action=allow
    - program=
  susp_image:
    winlog.event_data.CommandLine|contains:
    - '*%TEMP%*'
    - '*:\RECYCLER\\*'
    - '*C:\$Recycle.bin\\*'
    - '*:\SystemVolumeInformation\\*'
    - '*C:\Windows\Temp\\*'
    - '*C:\Temp\\*'
    - '*C:\Users\Public\\*'
    - '%Public%\\*'
    - '*C:\Users\Default\\*'
    - '*C:\Users\Desktop\\*'
    - '*\Downloads\\*'
    - '*\Temporary Internet Files\Content.Outlook\\*'
    - '*\Local Settings\Temporary Internet Files\\*'
    - winlog.event_data.C:\\Windows\\Tasks\\*
    - winlog.event_data.C:\\Windows\\debug\\*
    - winlog.event_data.C:\\Windows\\fonts\\*
    - winlog.event_data.C:\\Windows\\help\\*
    - winlog.event_data.C:\\Windows\\drivers\\*
    - winlog.event_data.C:\\Windows\\addins\\*
    - winlog.event_data.C:\\Windows\\cursors\\*
    - winlog.event_data.C:\\Windows\\system32\tasks\\*
falsepositives:
- Legitimate administration
id: a35f5a72-f347-4e36-8895-9869b0d5fc6d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://www.virusradar.com/en/Win32_Kasidet.AD/description
- https://www.hybrid-analysis.com/sample/07e789f4f2f3259e7559fdccb36e96814c2dbff872a21e1fa03de9ee377d581f?environmentId=100
status: experimental
tags:
- attack.defense_evasion
- attack.t1089
- attack.t1562.004
title: Netsh Program Allowed with Suspcious Location
