action: global
author: Florian Roth, Markus Neis
date: 2018/03/23
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report
  in March 2018
detection:
  condition: 1 of them
  selection_service:
    EventID: 4698
    TaskName:
    - SC Scheduled Scan
    - UpdatMachine
falsepositives:
- Unknown
id: 2f3b5cd3-ba8b-4c21-9768-63c645c61f6e
level: critical
logsource:
  product: windows
  service: security
modified: 2020/08/26
product: windows
references:
- https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
service: security
tags:
- attack.persistence
- attack.g0049
- attack.t1053
- attack.t1053.005
- attack.s0111
- attack.t1050
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071
- attack.t1071.004
title: Chafer Activity
