author: juju4
category: process_creation
date: 2019/01/16
description: Detects suspicious process run from unusual locations
detection:
  condition: selection
  selection:
    winlog.event_data.Image:
    - '*:\RECYCLER\\*'
    - '*:\SystemVolumeInformation\\*'
    - winlog.event_data.C:\\Windows\\Tasks\\*
    - winlog.event_data.C:\\Windows\\debug\\*
    - winlog.event_data.C:\\Windows\\fonts\\*
    - winlog.event_data.C:\\Windows\\help\\*
    - winlog.event_data.C:\\Windows\\drivers\\*
    - winlog.event_data.C:\\Windows\\addins\\*
    - winlog.event_data.C:\\Windows\\cursors\\*
    - winlog.event_data.C:\\Windows\\system32\tasks\\*
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: 15b75071-74cc-47e0-b4c6-b43744a62a2b
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://car.mitre.org/wiki/CAR-2013-05-002
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- car.2013-05-002
title: Suspicious Process Start Locations
