author: Florian Roth
category: process_creation
date: 2020/06/04
description: Detects suspicious command lines used in Covenant luanchers
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - ' -Sta -Nop -Window Hidden -Command '
    - ' -Sta -Nop -Window Hidden -EncodedCommand '
    - 'sv o (New-Object IO.MemorySteam);sv d '
    - mshta file.hta
    - -EncodedCommand cwB2ACAAbwAgA
    - winlog.event_data.GruntHTTP
id: c260b6db-48ba-4b4a-a76f-2f67644e99d2
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://posts.specterops.io/covenant-v0-5-eee0507b85ba
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1059.001
- attack.t1564.003
- attack.t1086
title: Covenant Launcher Indicators
