author: Florian Roth
category: process_creation
date: 2019/10/22
description: Detects suspicious calls of DLLs in rundll32.dll exports by ordinal
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine: '*\rundll32.exe *,#*'
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
- Windows contol panel elements have been identified as source (mmc)
id: e79a9e79-eb72-4e78-a628-0e7e8f59e89c
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://techtalk.pcmatic.com/2017/11/30/running-dll-files-malware-analysis/
- https://github.com/Neo23x0/DLLRunner
- https://twitter.com/cyb3rops/status/1186631731543236608
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.011
- attack.t1085
title: Suspicious Call by Ordinal
