author: Florian Roth, Patrick Bareiss
category: process_creation
date: 2017/11/27
description: Detects a Windows program executable started in a suspicious folder
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image:
    - \SystemRoot\System32\\*
    - winlog.event_data.C:\Windows\System32\\*
    - winlog.event_data.C:\Windows\system32\\*
    - winlog.event_data.C:\Windows\SysWow64\\*
    - winlog.event_data.C:\Windows\SysWOW64\\*
    - winlog.event_data.C:\Windows\explorer.exe
    - winlog.event_data.C:\Windows\winsxs\\*
    - winlog.event_data.C:\Windows\WinSxS\\*
  selection:
    winlog.event_data.Image:
    - '*\svchost.exe'
    - '*\rundll32.exe'
    - '*\services.exe'
    - '*\powershell.exe'
    - '*\regsvr32.exe'
    - '*\spoolsv.exe'
    - '*\lsass.exe'
    - '*\smss.exe'
    - '*\csrss.exe'
    - '*\conhost.exe'
    - '*\wininit.exe'
    - '*\lsm.exe'
    - '*\winlogon.exe'
    - '*\explorer.exe'
    - '*\taskhost.exe'
    - '*\Taskmgr.exe'
    - '*\sihost.exe'
    - '*\RuntimeBroker.exe'
    - '*\smartscreen.exe'
    - '*\dllhost.exe'
    - '*\audiodg.exe'
    - '*\wlanext.exe'
falsepositives:
- Exotic software
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
id: e4a6b256-3e47-40fc-89d2-7a477edd6915
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/GelosSnake/status/934900723426439170
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
title: System File Execution Location Anomaly
