action: global
author: Florian Roth, Tom Ueltschi
category: process_creation
date: 2017/11/10
description: Detects javaw.exe in AppData folder as used by Adwind / JRAT
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine:
    - '*\AppData\Roaming\Oracle*\java*.exe *'
    - '*cscript.exe *Retrive*.vbs *'
id: 28368e95-4b2e-421e-a662-0dc14ed7f088
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://www.hybrid-analysis.com/sample/ba86fa0d4b6af2db0656a88b1dd29f36fe362473ae8ad04255c4e52f214a541c?environmentId=100
- https://www.first.org/resources/papers/conf2017/Advanced-Incident-Detection-and-Threat-Hunting-using-Sysmon-and-Splunk.pdf
status: experimental
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
- attack.t1064
title: Adwind RAT / JRAT
