action: global
author: Florian Roth
date: 2019/12/22
description: Detects the use of CreateMiniDump hack tool used to dump the LSASS process
  memory for credential extraction on the attacker's machine
detection:
  condition: 1 of them
  selection:
    winlog.event_data.TargetFilename|contains: '*\lsass.dmp'
    winlog.event_id: 11
falsepositives:
- Unknown
id: d9ca3e88-2b6f-431d-a368-99f17f5a38d6
level: high
logsource:
  product: windows
  service: sysmon
product: windows
references:
- https://ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsass-passwords-without-mimikatz-minidumpwritedump-av-signature-bypass
service: sysmon
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003
title: CreateMiniDump Hacktool
