author: Roberto Rodriguez @Cyb3rWard0g
category: image_load
date: 2019/09/12
description: Detects execution of PowerShell
detection:
  condition: selection
  selection:
    winlog.event_data.Description: system.management.automation
    winlog.event_data.ImageLoaded|contains: system.management.automation
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.Image
- winlog.event_data.ProcessId
- winlog.event_data.ImageLoaded
id: 867613fb-fa60-4497-a017-a82df74a172c
level: medium
logsource:
  category: image_load
  product: windows
modified: 2019/11/10
product: windows
references:
- https://github.com/hunters-forge/ThreatHunter-Playbook/blob/8869b7a58dba1cff63bae1d7ab923974b8c0539b/playbooks/WIN-190410151110.yaml
status: experimental
tags:
- attack.execution
- attack.t1086
- attack.t1059.001
title: PowerShell Execution
