author: Josh Brower @DefensiveDepth
date: 2020/08/22
description: Detects connections from routable IPs to an RDP listener - which is indicative
  of a publicly-accessible RDP service.
detection:
  condition: not selection
  selection:
    src_ip|startswith:
    - 192.168.
    - '10.'
    - 172.16.
    - 172.17.
    - 172.18.
    - 172.19.
    - 172.20.
    - 172.21.
    - 172.22.
    - 172.23.
    - 172.24.
    - 172.25.
    - 172.26.
    - 172.27.
    - 172.28.
    - 172.29.
    - 172.30.
    - 172.31.
falsepositives:
- none
fields:
- src_ip
- dst_ip
id: 1fc0809e-06bf-4de3-ad52-25e5263b7623
level: high
logsource:
  product: zeek
  service: rdp
product: zeek
references:
- https://attack.mitre.org/techniques/T1021/001/
service: rdp
status: experimental
tags:
- attack.t1021
- attack.t1021.001
title: Publicly Accessible RDP Service
